Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x179c (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 34 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xb4a71): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xae0e9): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x88af1): C:/Users/MrDhrumil/Desktop/DIC/Embe Dic Intern/DRV8711_my_drive_m2/Debug
    <1a>   DW_AT_ranges      : 0x1b
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 10 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x620f1): signed char
 <1><31>: Abbrev Number: 6 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x394e2): __uint8_t
    <36>   DW_AT_decl_file   : 3
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 10 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xbc9ac): unsigned char
 <1><44>: Abbrev Number: 10 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x915a8): short int
 <1><4b>: Abbrev Number: 6 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x9f50b): __uint16_t
    <50>   DW_AT_decl_file   : 3
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 10 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xbb1d5): short unsigned int
 <1><5e>: Abbrev Number: 10 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x101f5): long int
 <1><65>: Abbrev Number: 6 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7c878): __uint32_t
    <6a>   DW_AT_decl_file   : 3
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 10 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4b1af): long unsigned int
 <1><78>: Abbrev Number: 10 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x59824): long long int
 <1><7f>: Abbrev Number: 10 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x291cf): long long unsigned int
 <1><86>: Abbrev Number: 35 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 10 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xf8b9): unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x394e4): uint8_t
    <99>   DW_AT_decl_file   : 4
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 6 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0x9f50d): uint16_t
    <aa>   DW_AT_decl_file   : 4
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 6 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0x7c87a): uint32_t
    <bb>   DW_AT_decl_file   : 4
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 18 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x8d>
    <d5>   DW_AT_upper_bound : 1
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 15 (DW_TAG_structure_type)
    <d8>   DW_AT_byte_size   : 24
    <d9>   DW_AT_decl_file   : 5
    <da>   DW_AT_decl_line   : 345
    <dc>   DW_AT_decl_column : 9
    <dc>   DW_AT_sibling     : <0x12e>
 <2><e0>: Abbrev Number: 5 (DW_TAG_member)
    <e1>   DW_AT_name        : CR
    <e4>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 347
    <e6>   DW_AT_decl_column : 17
    <e6>   DW_AT_type        : <0xc2>
    <ea>   DW_AT_data_member_location: 0
 <2><eb>: Abbrev Number: 2 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x4a9fe): NDTR
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 348
    <f3>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xc2>
    <f8>   DW_AT_data_member_location: 4
 <2><f9>: Abbrev Number: 5 (DW_TAG_member)
    <fa>   DW_AT_name        : PAR
    <fe>   DW_AT_decl_file   : 5
    <fe>   DW_AT_decl_line   : 349
    <100>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 8
 <2><105>: Abbrev Number: 2 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x518dd): M0AR
    <10a>   DW_AT_decl_file   : 5
    <10b>   DW_AT_decl_line   : 350
    <10d>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xc2>
    <112>   DW_AT_data_member_location: 12
 <2><113>: Abbrev Number: 2 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x6c688): M1AR
    <118>   DW_AT_decl_file   : 5
    <119>   DW_AT_decl_line   : 351
    <11b>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xc2>
    <120>   DW_AT_data_member_location: 16
 <2><121>: Abbrev Number: 5 (DW_TAG_member)
    <122>   DW_AT_name        : FCR
    <126>   DW_AT_decl_file   : 5
    <126>   DW_AT_decl_line   : 352
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xc2>
    <12c>   DW_AT_data_member_location: 20
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 11 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0xb13c3): DMA_Stream_TypeDef
    <133>   DW_AT_decl_file   : 5
    <134>   DW_AT_decl_line   : 353
    <136>   DW_AT_decl_column : 3
    <136>   DW_AT_type        : <0xd7>
 <1><13a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 40
    <13c>   DW_AT_decl_file   : 5
    <13d>   DW_AT_decl_line   : 526
    <13f>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x1bc>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x7f12c): MODER
    <148>   DW_AT_decl_file   : 5
    <149>   DW_AT_decl_line   : 528
    <14b>   DW_AT_decl_column : 17
    <14c>   DW_AT_type        : <0xc2>
    <150>   DW_AT_data_member_location: 0
 <2><151>: Abbrev Number: 2 (DW_TAG_member)
    <152>   DW_AT_name        : (indirect string, offset: 0x96efe): OTYPER
    <156>   DW_AT_decl_file   : 5
    <157>   DW_AT_decl_line   : 529
    <159>   DW_AT_decl_column : 17
    <15a>   DW_AT_type        : <0xc2>
    <15e>   DW_AT_data_member_location: 4
 <2><15f>: Abbrev Number: 2 (DW_TAG_member)
    <160>   DW_AT_name        : (indirect string, offset: 0xa9b57): OSPEEDR
    <164>   DW_AT_decl_file   : 5
    <165>   DW_AT_decl_line   : 530
    <167>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xc2>
    <16c>   DW_AT_data_member_location: 8
 <2><16d>: Abbrev Number: 2 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x713ce): PUPDR
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 531
    <175>   DW_AT_decl_column : 17
    <176>   DW_AT_type        : <0xc2>
    <17a>   DW_AT_data_member_location: 12
 <2><17b>: Abbrev Number: 5 (DW_TAG_member)
    <17c>   DW_AT_name        : IDR
    <180>   DW_AT_decl_file   : 5
    <180>   DW_AT_decl_line   : 532
    <182>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xc2>
    <186>   DW_AT_data_member_location: 16
 <2><187>: Abbrev Number: 5 (DW_TAG_member)
    <188>   DW_AT_name        : ODR
    <18c>   DW_AT_decl_file   : 5
    <18c>   DW_AT_decl_line   : 533
    <18e>   DW_AT_decl_column : 17
    <18e>   DW_AT_type        : <0xc2>
    <192>   DW_AT_data_member_location: 20
 <2><193>: Abbrev Number: 2 (DW_TAG_member)
    <194>   DW_AT_name        : (indirect string, offset: 0x2c6c0): BSRR
    <198>   DW_AT_decl_file   : 5
    <199>   DW_AT_decl_line   : 534
    <19b>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0xc2>
    <1a0>   DW_AT_data_member_location: 24
 <2><1a1>: Abbrev Number: 2 (DW_TAG_member)
    <1a2>   DW_AT_name        : (indirect string, offset: 0xa737a): LCKR
    <1a6>   DW_AT_decl_file   : 5
    <1a7>   DW_AT_decl_line   : 535
    <1a9>   DW_AT_decl_column : 17
    <1aa>   DW_AT_type        : <0xc2>
    <1ae>   DW_AT_data_member_location: 28
 <2><1af>: Abbrev Number: 5 (DW_TAG_member)
    <1b0>   DW_AT_name        : AFR
    <1b4>   DW_AT_decl_file   : 5
    <1b4>   DW_AT_decl_line   : 536
    <1b6>   DW_AT_decl_column : 17
    <1b6>   DW_AT_type        : <0x1cc>
    <1ba>   DW_AT_data_member_location: 32
 <2><1bb>: Abbrev Number: 0
 <1><1bc>: Abbrev Number: 18 (DW_TAG_array_type)
    <1bd>   DW_AT_type        : <0xc2>
    <1c1>   DW_AT_sibling     : <0x1cc>
 <2><1c5>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <1c6>   DW_AT_type        : <0x8d>
    <1ca>   DW_AT_upper_bound : 1
 <2><1cb>: Abbrev Number: 0
 <1><1cc>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <1cd>   DW_AT_type        : <0x1bc>
 <1><1d1>: Abbrev Number: 11 (DW_TAG_typedef)
    <1d2>   DW_AT_name        : (indirect string, offset: 0xbda64): GPIO_TypeDef
    <1d6>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 537
    <1d9>   DW_AT_decl_column : 3
    <1d9>   DW_AT_type        : <0x13a>
 <1><1dd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1de>   DW_AT_byte_size   : 8
    <1df>   DW_AT_decl_file   : 5
    <1e0>   DW_AT_decl_line   : 586
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_sibling     : <0x1fe>
 <2><1e6>: Abbrev Number: 5 (DW_TAG_member)
    <1e7>   DW_AT_name        : CR
    <1ea>   DW_AT_decl_file   : 5
    <1ea>   DW_AT_decl_line   : 588
    <1ec>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0xc2>
    <1f0>   DW_AT_data_member_location: 0
 <2><1f1>: Abbrev Number: 5 (DW_TAG_member)
    <1f2>   DW_AT_name        : CSR
    <1f6>   DW_AT_decl_file   : 5
    <1f6>   DW_AT_decl_line   : 589
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xc2>
    <1fc>   DW_AT_data_member_location: 4
 <2><1fd>: Abbrev Number: 0
 <1><1fe>: Abbrev Number: 11 (DW_TAG_typedef)
    <1ff>   DW_AT_name        : (indirect string, offset: 0x8d025): PWR_TypeDef
    <203>   DW_AT_decl_file   : 5
    <204>   DW_AT_decl_line   : 590
    <206>   DW_AT_decl_column : 3
    <206>   DW_AT_type        : <0x1dd>
 <1><20a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <20b>   DW_AT_byte_size   : 136
    <20c>   DW_AT_decl_file   : 5
    <20d>   DW_AT_decl_line   : 596
    <20f>   DW_AT_decl_column : 9
    <20f>   DW_AT_sibling     : <0x3b1>
 <2><213>: Abbrev Number: 5 (DW_TAG_member)
    <214>   DW_AT_name        : CR
    <217>   DW_AT_decl_file   : 5
    <217>   DW_AT_decl_line   : 598
    <219>   DW_AT_decl_column : 17
    <219>   DW_AT_type        : <0xc2>
    <21d>   DW_AT_data_member_location: 0
 <2><21e>: Abbrev Number: 2 (DW_TAG_member)
    <21f>   DW_AT_name        : (indirect string, offset: 0x8875f): PLLCFGR
    <223>   DW_AT_decl_file   : 5
    <224>   DW_AT_decl_line   : 599
    <226>   DW_AT_decl_column : 17
    <227>   DW_AT_type        : <0xc2>
    <22b>   DW_AT_data_member_location: 4
 <2><22c>: Abbrev Number: 2 (DW_TAG_member)
    <22d>   DW_AT_name        : (indirect string, offset: 0x88762): CFGR
    <231>   DW_AT_decl_file   : 5
    <232>   DW_AT_decl_line   : 600
    <234>   DW_AT_decl_column : 17
    <235>   DW_AT_type        : <0xc2>
    <239>   DW_AT_data_member_location: 8
 <2><23a>: Abbrev Number: 5 (DW_TAG_member)
    <23b>   DW_AT_name        : CIR
    <23f>   DW_AT_decl_file   : 5
    <23f>   DW_AT_decl_line   : 601
    <241>   DW_AT_decl_column : 17
    <241>   DW_AT_type        : <0xc2>
    <245>   DW_AT_data_member_location: 12
 <2><246>: Abbrev Number: 2 (DW_TAG_member)
    <247>   DW_AT_name        : (indirect string, offset: 0x9b42b): AHB1RSTR
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 602
    <24e>   DW_AT_decl_column : 17
    <24f>   DW_AT_type        : <0xc2>
    <253>   DW_AT_data_member_location: 16
 <2><254>: Abbrev Number: 2 (DW_TAG_member)
    <255>   DW_AT_name        : (indirect string, offset: 0x15e31): AHB2RSTR
    <259>   DW_AT_decl_file   : 5
    <25a>   DW_AT_decl_line   : 603
    <25c>   DW_AT_decl_column : 17
    <25d>   DW_AT_type        : <0xc2>
    <261>   DW_AT_data_member_location: 20
 <2><262>: Abbrev Number: 2 (DW_TAG_member)
    <263>   DW_AT_name        : (indirect string, offset: 0x40ce9): AHB3RSTR
    <267>   DW_AT_decl_file   : 5
    <268>   DW_AT_decl_line   : 604
    <26a>   DW_AT_decl_column : 17
    <26b>   DW_AT_type        : <0xc2>
    <26f>   DW_AT_data_member_location: 24
 <2><270>: Abbrev Number: 2 (DW_TAG_member)
    <271>   DW_AT_name        : (indirect string, offset: 0xb8362): RESERVED0
    <275>   DW_AT_decl_file   : 5
    <276>   DW_AT_decl_line   : 605
    <278>   DW_AT_decl_column : 17
    <279>   DW_AT_type        : <0xb6>
    <27d>   DW_AT_data_member_location: 28
 <2><27e>: Abbrev Number: 2 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0x15974): APB1RSTR
    <283>   DW_AT_decl_file   : 5
    <284>   DW_AT_decl_line   : 606
    <286>   DW_AT_decl_column : 17
    <287>   DW_AT_type        : <0xc2>
    <28b>   DW_AT_data_member_location: 32
 <2><28c>: Abbrev Number: 2 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0x55011): APB2RSTR
    <291>   DW_AT_decl_file   : 5
    <292>   DW_AT_decl_line   : 607
    <294>   DW_AT_decl_column : 17
    <295>   DW_AT_type        : <0xc2>
    <299>   DW_AT_data_member_location: 36
 <2><29a>: Abbrev Number: 2 (DW_TAG_member)
    <29b>   DW_AT_name        : (indirect string, offset: 0xb836c): RESERVED1
    <29f>   DW_AT_decl_file   : 5
    <2a0>   DW_AT_decl_line   : 608
    <2a2>   DW_AT_decl_column : 17
    <2a3>   DW_AT_type        : <0xc7>
    <2a7>   DW_AT_data_member_location: 40
 <2><2a8>: Abbrev Number: 2 (DW_TAG_member)
    <2a9>   DW_AT_name        : (indirect string, offset: 0xf84e): AHB1ENR
    <2ad>   DW_AT_decl_file   : 5
    <2ae>   DW_AT_decl_line   : 609
    <2b0>   DW_AT_decl_column : 17
    <2b1>   DW_AT_type        : <0xc2>
    <2b5>   DW_AT_data_member_location: 48
 <2><2b6>: Abbrev Number: 2 (DW_TAG_member)
    <2b7>   DW_AT_name        : (indirect string, offset: 0x34386): AHB2ENR
    <2bb>   DW_AT_decl_file   : 5
    <2bc>   DW_AT_decl_line   : 610
    <2be>   DW_AT_decl_column : 17
    <2bf>   DW_AT_type        : <0xc2>
    <2c3>   DW_AT_data_member_location: 52
 <2><2c4>: Abbrev Number: 2 (DW_TAG_member)
    <2c5>   DW_AT_name        : (indirect string, offset: 0x58008): AHB3ENR
    <2c9>   DW_AT_decl_file   : 5
    <2ca>   DW_AT_decl_line   : 611
    <2cc>   DW_AT_decl_column : 17
    <2cd>   DW_AT_type        : <0xc2>
    <2d1>   DW_AT_data_member_location: 56
 <2><2d2>: Abbrev Number: 2 (DW_TAG_member)
    <2d3>   DW_AT_name        : (indirect string, offset: 0xb8376): RESERVED2
    <2d7>   DW_AT_decl_file   : 5
    <2d8>   DW_AT_decl_line   : 612
    <2da>   DW_AT_decl_column : 17
    <2db>   DW_AT_type        : <0xb6>
    <2df>   DW_AT_data_member_location: 60
 <2><2e0>: Abbrev Number: 2 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0x70613): APB1ENR
    <2e5>   DW_AT_decl_file   : 5
    <2e6>   DW_AT_decl_line   : 613
    <2e8>   DW_AT_decl_column : 17
    <2e9>   DW_AT_type        : <0xc2>
    <2ed>   DW_AT_data_member_location: 64
 <2><2ee>: Abbrev Number: 2 (DW_TAG_member)
    <2ef>   DW_AT_name        : (indirect string, offset: 0x16f1b): APB2ENR
    <2f3>   DW_AT_decl_file   : 5
    <2f4>   DW_AT_decl_line   : 614
    <2f6>   DW_AT_decl_column : 17
    <2f7>   DW_AT_type        : <0xc2>
    <2fb>   DW_AT_data_member_location: 68
 <2><2fc>: Abbrev Number: 2 (DW_TAG_member)
    <2fd>   DW_AT_name        : (indirect string, offset: 0xb8380): RESERVED3
    <301>   DW_AT_decl_file   : 5
    <302>   DW_AT_decl_line   : 615
    <304>   DW_AT_decl_column : 17
    <305>   DW_AT_type        : <0xc7>
    <309>   DW_AT_data_member_location: 72
 <2><30a>: Abbrev Number: 2 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x9f390): AHB1LPENR
    <30f>   DW_AT_decl_file   : 5
    <310>   DW_AT_decl_line   : 616
    <312>   DW_AT_decl_column : 17
    <313>   DW_AT_type        : <0xc2>
    <317>   DW_AT_data_member_location: 80
 <2><318>: Abbrev Number: 2 (DW_TAG_member)
    <319>   DW_AT_name        : (indirect string, offset: 0x2c36d): AHB2LPENR
    <31d>   DW_AT_decl_file   : 5
    <31e>   DW_AT_decl_line   : 617
    <320>   DW_AT_decl_column : 17
    <321>   DW_AT_type        : <0xc2>
    <325>   DW_AT_data_member_location: 84
 <2><326>: Abbrev Number: 2 (DW_TAG_member)
    <327>   DW_AT_name        : (indirect string, offset: 0x83d2c): AHB3LPENR
    <32b>   DW_AT_decl_file   : 5
    <32c>   DW_AT_decl_line   : 618
    <32e>   DW_AT_decl_column : 17
    <32f>   DW_AT_type        : <0xc2>
    <333>   DW_AT_data_member_location: 88
 <2><334>: Abbrev Number: 2 (DW_TAG_member)
    <335>   DW_AT_name        : (indirect string, offset: 0xb838a): RESERVED4
    <339>   DW_AT_decl_file   : 5
    <33a>   DW_AT_decl_line   : 619
    <33c>   DW_AT_decl_column : 17
    <33d>   DW_AT_type        : <0xb6>
    <341>   DW_AT_data_member_location: 92
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0xa3e32): APB1LPENR
    <347>   DW_AT_decl_file   : 5
    <348>   DW_AT_decl_line   : 620
    <34a>   DW_AT_decl_column : 17
    <34b>   DW_AT_type        : <0xc2>
    <34f>   DW_AT_data_member_location: 96
 <2><350>: Abbrev Number: 2 (DW_TAG_member)
    <351>   DW_AT_name        : (indirect string, offset: 0x31f18): APB2LPENR
    <355>   DW_AT_decl_file   : 5
    <356>   DW_AT_decl_line   : 621
    <358>   DW_AT_decl_column : 17
    <359>   DW_AT_type        : <0xc2>
    <35d>   DW_AT_data_member_location: 100
 <2><35e>: Abbrev Number: 2 (DW_TAG_member)
    <35f>   DW_AT_name        : (indirect string, offset: 0xb8394): RESERVED5
    <363>   DW_AT_decl_file   : 5
    <364>   DW_AT_decl_line   : 622
    <366>   DW_AT_decl_column : 17
    <367>   DW_AT_type        : <0xc7>
    <36b>   DW_AT_data_member_location: 104
 <2><36c>: Abbrev Number: 2 (DW_TAG_member)
    <36d>   DW_AT_name        : (indirect string, offset: 0x1b2f1): BDCR
    <371>   DW_AT_decl_file   : 5
    <372>   DW_AT_decl_line   : 623
    <374>   DW_AT_decl_column : 17
    <375>   DW_AT_type        : <0xc2>
    <379>   DW_AT_data_member_location: 112
 <2><37a>: Abbrev Number: 5 (DW_TAG_member)
    <37b>   DW_AT_name        : CSR
    <37f>   DW_AT_decl_file   : 5
    <37f>   DW_AT_decl_line   : 624
    <381>   DW_AT_decl_column : 17
    <381>   DW_AT_type        : <0xc2>
    <385>   DW_AT_data_member_location: 116
 <2><386>: Abbrev Number: 2 (DW_TAG_member)
    <387>   DW_AT_name        : (indirect string, offset: 0x74bdf): RESERVED6
    <38b>   DW_AT_decl_file   : 5
    <38c>   DW_AT_decl_line   : 625
    <38e>   DW_AT_decl_column : 17
    <38f>   DW_AT_type        : <0xc7>
    <393>   DW_AT_data_member_location: 120
 <2><394>: Abbrev Number: 2 (DW_TAG_member)
    <395>   DW_AT_name        : (indirect string, offset: 0x67c2c): SSCGR
    <399>   DW_AT_decl_file   : 5
    <39a>   DW_AT_decl_line   : 626
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0xc2>
    <3a1>   DW_AT_data_member_location: 128
 <2><3a2>: Abbrev Number: 2 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x41685): PLLI2SCFGR
    <3a7>   DW_AT_decl_file   : 5
    <3a8>   DW_AT_decl_line   : 627
    <3aa>   DW_AT_decl_column : 17
    <3ab>   DW_AT_type        : <0xc2>
    <3af>   DW_AT_data_member_location: 132
 <2><3b0>: Abbrev Number: 0
 <1><3b1>: Abbrev Number: 11 (DW_TAG_typedef)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x5acce): RCC_TypeDef
    <3b6>   DW_AT_decl_file   : 5
    <3b7>   DW_AT_decl_line   : 628
    <3b9>   DW_AT_decl_column : 3
    <3b9>   DW_AT_type        : <0x20a>
 <1><3bd>: Abbrev Number: 15 (DW_TAG_structure_type)
    <3be>   DW_AT_byte_size   : 36
    <3bf>   DW_AT_decl_file   : 5
    <3c0>   DW_AT_decl_line   : 710
    <3c2>   DW_AT_decl_column : 9
    <3c2>   DW_AT_sibling     : <0x43b>
 <2><3c6>: Abbrev Number: 5 (DW_TAG_member)
    <3c7>   DW_AT_name        : CR1
    <3cb>   DW_AT_decl_file   : 5
    <3cb>   DW_AT_decl_line   : 712
    <3cd>   DW_AT_decl_column : 17
    <3cd>   DW_AT_type        : <0xc2>
    <3d1>   DW_AT_data_member_location: 0
 <2><3d2>: Abbrev Number: 5 (DW_TAG_member)
    <3d3>   DW_AT_name        : CR2
    <3d7>   DW_AT_decl_file   : 5
    <3d7>   DW_AT_decl_line   : 713
    <3d9>   DW_AT_decl_column : 17
    <3d9>   DW_AT_type        : <0xc2>
    <3dd>   DW_AT_data_member_location: 4
 <2><3de>: Abbrev Number: 5 (DW_TAG_member)
    <3df>   DW_AT_name        : SR
    <3e2>   DW_AT_decl_file   : 5
    <3e2>   DW_AT_decl_line   : 714
    <3e4>   DW_AT_decl_column : 17
    <3e4>   DW_AT_type        : <0xc2>
    <3e8>   DW_AT_data_member_location: 8
 <2><3e9>: Abbrev Number: 5 (DW_TAG_member)
    <3ea>   DW_AT_name        : DR
    <3ed>   DW_AT_decl_file   : 5
    <3ed>   DW_AT_decl_line   : 715
    <3ef>   DW_AT_decl_column : 17
    <3ef>   DW_AT_type        : <0xc2>
    <3f3>   DW_AT_data_member_location: 12
 <2><3f4>: Abbrev Number: 2 (DW_TAG_member)
    <3f5>   DW_AT_name        : (indirect string, offset: 0x2fbfd): CRCPR
    <3f9>   DW_AT_decl_file   : 5
    <3fa>   DW_AT_decl_line   : 716
    <3fc>   DW_AT_decl_column : 17
    <3fd>   DW_AT_type        : <0xc2>
    <401>   DW_AT_data_member_location: 16
 <2><402>: Abbrev Number: 2 (DW_TAG_member)
    <403>   DW_AT_name        : (indirect string, offset: 0x74790): RXCRCR
    <407>   DW_AT_decl_file   : 5
    <408>   DW_AT_decl_line   : 717
    <40a>   DW_AT_decl_column : 17
    <40b>   DW_AT_type        : <0xc2>
    <40f>   DW_AT_data_member_location: 20
 <2><410>: Abbrev Number: 2 (DW_TAG_member)
    <411>   DW_AT_name        : (indirect string, offset: 0x61a81): TXCRCR
    <415>   DW_AT_decl_file   : 5
    <416>   DW_AT_decl_line   : 718
    <418>   DW_AT_decl_column : 17
    <419>   DW_AT_type        : <0xc2>
    <41d>   DW_AT_data_member_location: 24
 <2><41e>: Abbrev Number: 2 (DW_TAG_member)
    <41f>   DW_AT_name        : (indirect string, offset: 0x41688): I2SCFGR
    <423>   DW_AT_decl_file   : 5
    <424>   DW_AT_decl_line   : 719
    <426>   DW_AT_decl_column : 17
    <427>   DW_AT_type        : <0xc2>
    <42b>   DW_AT_data_member_location: 28
 <2><42c>: Abbrev Number: 2 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0x5c7b7): I2SPR
    <431>   DW_AT_decl_file   : 5
    <432>   DW_AT_decl_line   : 720
    <434>   DW_AT_decl_column : 17
    <435>   DW_AT_type        : <0xc2>
    <439>   DW_AT_data_member_location: 32
 <2><43a>: Abbrev Number: 0
 <1><43b>: Abbrev Number: 11 (DW_TAG_typedef)
    <43c>   DW_AT_name        : (indirect string, offset: 0x2e186): SPI_TypeDef
    <440>   DW_AT_decl_file   : 5
    <441>   DW_AT_decl_line   : 721
    <443>   DW_AT_decl_column : 3
    <443>   DW_AT_type        : <0x3bd>
 <1><447>: Abbrev Number: 15 (DW_TAG_structure_type)
    <448>   DW_AT_byte_size   : 84
    <449>   DW_AT_decl_file   : 5
    <44a>   DW_AT_decl_line   : 728
    <44c>   DW_AT_decl_column : 9
    <44c>   DW_AT_sibling     : <0x561>
 <2><450>: Abbrev Number: 5 (DW_TAG_member)
    <451>   DW_AT_name        : CR1
    <455>   DW_AT_decl_file   : 5
    <455>   DW_AT_decl_line   : 730
    <457>   DW_AT_decl_column : 17
    <457>   DW_AT_type        : <0xc2>
    <45b>   DW_AT_data_member_location: 0
 <2><45c>: Abbrev Number: 5 (DW_TAG_member)
    <45d>   DW_AT_name        : CR2
    <461>   DW_AT_decl_file   : 5
    <461>   DW_AT_decl_line   : 731
    <463>   DW_AT_decl_column : 17
    <463>   DW_AT_type        : <0xc2>
    <467>   DW_AT_data_member_location: 4
 <2><468>: Abbrev Number: 2 (DW_TAG_member)
    <469>   DW_AT_name        : (indirect string, offset: 0x39d32): SMCR
    <46d>   DW_AT_decl_file   : 5
    <46e>   DW_AT_decl_line   : 732
    <470>   DW_AT_decl_column : 17
    <471>   DW_AT_type        : <0xc2>
    <475>   DW_AT_data_member_location: 8
 <2><476>: Abbrev Number: 2 (DW_TAG_member)
    <477>   DW_AT_name        : (indirect string, offset: 0x3fd15): DIER
    <47b>   DW_AT_decl_file   : 5
    <47c>   DW_AT_decl_line   : 733
    <47e>   DW_AT_decl_column : 17
    <47f>   DW_AT_type        : <0xc2>
    <483>   DW_AT_data_member_location: 12
 <2><484>: Abbrev Number: 5 (DW_TAG_member)
    <485>   DW_AT_name        : SR
    <488>   DW_AT_decl_file   : 5
    <488>   DW_AT_decl_line   : 734
    <48a>   DW_AT_decl_column : 17
    <48a>   DW_AT_type        : <0xc2>
    <48e>   DW_AT_data_member_location: 16
 <2><48f>: Abbrev Number: 5 (DW_TAG_member)
    <490>   DW_AT_name        : EGR
    <494>   DW_AT_decl_file   : 5
    <494>   DW_AT_decl_line   : 735
    <496>   DW_AT_decl_column : 17
    <496>   DW_AT_type        : <0xc2>
    <49a>   DW_AT_data_member_location: 20
 <2><49b>: Abbrev Number: 2 (DW_TAG_member)
    <49c>   DW_AT_name        : (indirect string, offset: 0xb20a2): CCMR1
    <4a0>   DW_AT_decl_file   : 5
    <4a1>   DW_AT_decl_line   : 736
    <4a3>   DW_AT_decl_column : 17
    <4a4>   DW_AT_type        : <0xc2>
    <4a8>   DW_AT_data_member_location: 24
 <2><4a9>: Abbrev Number: 2 (DW_TAG_member)
    <4aa>   DW_AT_name        : (indirect string, offset: 0x4e598): CCMR2
    <4ae>   DW_AT_decl_file   : 5
    <4af>   DW_AT_decl_line   : 737
    <4b1>   DW_AT_decl_column : 17
    <4b2>   DW_AT_type        : <0xc2>
    <4b6>   DW_AT_data_member_location: 28
 <2><4b7>: Abbrev Number: 2 (DW_TAG_member)
    <4b8>   DW_AT_name        : (indirect string, offset: 0x2ff10): CCER
    <4bc>   DW_AT_decl_file   : 5
    <4bd>   DW_AT_decl_line   : 738
    <4bf>   DW_AT_decl_column : 17
    <4c0>   DW_AT_type        : <0xc2>
    <4c4>   DW_AT_data_member_location: 32
 <2><4c5>: Abbrev Number: 5 (DW_TAG_member)
    <4c6>   DW_AT_name        : CNT
    <4ca>   DW_AT_decl_file   : 5
    <4ca>   DW_AT_decl_line   : 739
    <4cc>   DW_AT_decl_column : 17
    <4cc>   DW_AT_type        : <0xc2>
    <4d0>   DW_AT_data_member_location: 36
 <2><4d1>: Abbrev Number: 5 (DW_TAG_member)
    <4d2>   DW_AT_name        : PSC
    <4d6>   DW_AT_decl_file   : 5
    <4d6>   DW_AT_decl_line   : 740
    <4d8>   DW_AT_decl_column : 17
    <4d8>   DW_AT_type        : <0xc2>
    <4dc>   DW_AT_data_member_location: 40
 <2><4dd>: Abbrev Number: 5 (DW_TAG_member)
    <4de>   DW_AT_name        : ARR
    <4e2>   DW_AT_decl_file   : 5
    <4e2>   DW_AT_decl_line   : 741
    <4e4>   DW_AT_decl_column : 17
    <4e4>   DW_AT_type        : <0xc2>
    <4e8>   DW_AT_data_member_location: 44
 <2><4e9>: Abbrev Number: 5 (DW_TAG_member)
    <4ea>   DW_AT_name        : RCR
    <4ee>   DW_AT_decl_file   : 5
    <4ee>   DW_AT_decl_line   : 742
    <4f0>   DW_AT_decl_column : 17
    <4f0>   DW_AT_type        : <0xc2>
    <4f4>   DW_AT_data_member_location: 48
 <2><4f5>: Abbrev Number: 2 (DW_TAG_member)
    <4f6>   DW_AT_name        : (indirect string, offset: 0x16f16): CCR1
    <4fa>   DW_AT_decl_file   : 5
    <4fb>   DW_AT_decl_line   : 743
    <4fd>   DW_AT_decl_column : 17
    <4fe>   DW_AT_type        : <0xc2>
    <502>   DW_AT_data_member_location: 52
 <2><503>: Abbrev Number: 2 (DW_TAG_member)
    <504>   DW_AT_name        : (indirect string, offset: 0x52412): CCR2
    <508>   DW_AT_decl_file   : 5
    <509>   DW_AT_decl_line   : 744
    <50b>   DW_AT_decl_column : 17
    <50c>   DW_AT_type        : <0xc2>
    <510>   DW_AT_data_member_location: 56
 <2><511>: Abbrev Number: 2 (DW_TAG_member)
    <512>   DW_AT_name        : (indirect string, offset: 0x9512c): CCR3
    <516>   DW_AT_decl_file   : 5
    <517>   DW_AT_decl_line   : 745
    <519>   DW_AT_decl_column : 17
    <51a>   DW_AT_type        : <0xc2>
    <51e>   DW_AT_data_member_location: 60
 <2><51f>: Abbrev Number: 2 (DW_TAG_member)
    <520>   DW_AT_name        : (indirect string, offset: 0xbd6e): CCR4
    <524>   DW_AT_decl_file   : 5
    <525>   DW_AT_decl_line   : 746
    <527>   DW_AT_decl_column : 17
    <528>   DW_AT_type        : <0xc2>
    <52c>   DW_AT_data_member_location: 64
 <2><52d>: Abbrev Number: 2 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x8509c): BDTR
    <532>   DW_AT_decl_file   : 5
    <533>   DW_AT_decl_line   : 747
    <535>   DW_AT_decl_column : 17
    <536>   DW_AT_type        : <0xc2>
    <53a>   DW_AT_data_member_location: 68
 <2><53b>: Abbrev Number: 5 (DW_TAG_member)
    <53c>   DW_AT_name        : DCR
    <540>   DW_AT_decl_file   : 5
    <540>   DW_AT_decl_line   : 748
    <542>   DW_AT_decl_column : 17
    <542>   DW_AT_type        : <0xc2>
    <546>   DW_AT_data_member_location: 72
 <2><547>: Abbrev Number: 2 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0xa79b9): DMAR
    <54c>   DW_AT_decl_file   : 5
    <54d>   DW_AT_decl_line   : 749
    <54f>   DW_AT_decl_column : 17
    <550>   DW_AT_type        : <0xc2>
    <554>   DW_AT_data_member_location: 76
 <2><555>: Abbrev Number: 5 (DW_TAG_member)
    <556>   DW_AT_name        : OR
    <559>   DW_AT_decl_file   : 5
    <559>   DW_AT_decl_line   : 750
    <55b>   DW_AT_decl_column : 17
    <55b>   DW_AT_type        : <0xc2>
    <55f>   DW_AT_data_member_location: 80
 <2><560>: Abbrev Number: 0
 <1><561>: Abbrev Number: 11 (DW_TAG_typedef)
    <562>   DW_AT_name        : (indirect string, offset: 0xb8ea5): TIM_TypeDef
    <566>   DW_AT_decl_file   : 5
    <567>   DW_AT_decl_line   : 751
    <569>   DW_AT_decl_column : 3
    <569>   DW_AT_type        : <0x447>
 <1><56d>: Abbrev Number: 10 (DW_TAG_base_type)
    <56e>   DW_AT_byte_size   : 8
    <56f>   DW_AT_encoding    : 4	(float)
    <570>   DW_AT_name        : (indirect string, offset: 0x14dd0): long double
 <1><574>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <575>   DW_AT_encoding    : 7	(unsigned)
    <575>   DW_AT_byte_size   : 1
    <575>   DW_AT_type        : <0x3d>
    <579>   DW_AT_decl_file   : 6
    <57a>   DW_AT_decl_line   : 39
    <57b>   DW_AT_decl_column : 1
    <57b>   DW_AT_sibling     : <0x598>
 <2><57f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <580>   DW_AT_name        : (indirect string, offset: 0x4275e): HAL_OK
    <584>   DW_AT_const_value : 0
 <2><585>: Abbrev Number: 4 (DW_TAG_enumerator)
    <586>   DW_AT_name        : (indirect string, offset: 0x7a614): HAL_ERROR
    <58a>   DW_AT_const_value : 1
 <2><58b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <58c>   DW_AT_name        : (indirect string, offset: 0x2284f): HAL_BUSY
    <590>   DW_AT_const_value : 2
 <2><591>: Abbrev Number: 4 (DW_TAG_enumerator)
    <592>   DW_AT_name        : (indirect string, offset: 0x39c7b): HAL_TIMEOUT
    <596>   DW_AT_const_value : 3
 <2><597>: Abbrev Number: 0
 <1><598>: Abbrev Number: 6 (DW_TAG_typedef)
    <599>   DW_AT_name        : (indirect string, offset: 0x22e4): HAL_StatusTypeDef
    <59d>   DW_AT_decl_file   : 6
    <59e>   DW_AT_decl_line   : 44
    <59f>   DW_AT_decl_column : 3
    <5a0>   DW_AT_type        : <0x574>
 <1><5a4>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <5a5>   DW_AT_encoding    : 7	(unsigned)
    <5a5>   DW_AT_byte_size   : 1
    <5a5>   DW_AT_type        : <0x3d>
    <5a9>   DW_AT_decl_file   : 6
    <5aa>   DW_AT_decl_line   : 50
    <5ab>   DW_AT_decl_column : 1
    <5ab>   DW_AT_sibling     : <0x5bc>
 <2><5af>: Abbrev Number: 4 (DW_TAG_enumerator)
    <5b0>   DW_AT_name        : (indirect string, offset: 0x90406): HAL_UNLOCKED
    <5b4>   DW_AT_const_value : 0
 <2><5b5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <5b6>   DW_AT_name        : (indirect string, offset: 0xc3253): HAL_LOCKED
    <5ba>   DW_AT_const_value : 1
 <2><5bb>: Abbrev Number: 0
 <1><5bc>: Abbrev Number: 6 (DW_TAG_typedef)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x73be3): HAL_LockTypeDef
    <5c1>   DW_AT_decl_file   : 6
    <5c2>   DW_AT_decl_line   : 53
    <5c3>   DW_AT_decl_column : 3
    <5c4>   DW_AT_type        : <0x5a4>
 <1><5c8>: Abbrev Number: 13 (DW_TAG_structure_type)
    <5c9>   DW_AT_byte_size   : 24
    <5ca>   DW_AT_decl_file   : 7
    <5cb>   DW_AT_decl_line   : 45
    <5cc>   DW_AT_decl_column : 9
    <5cc>   DW_AT_sibling     : <0x61f>
 <2><5d0>: Abbrev Number: 1 (DW_TAG_member)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x82c9c): PLLState
    <5d5>   DW_AT_decl_file   : 7
    <5d6>   DW_AT_decl_line   : 47
    <5d7>   DW_AT_decl_column : 12
    <5d8>   DW_AT_type        : <0xb6>
    <5dc>   DW_AT_data_member_location: 0
 <2><5dd>: Abbrev Number: 1 (DW_TAG_member)
    <5de>   DW_AT_name        : (indirect string, offset: 0x874e7): PLLSource
    <5e2>   DW_AT_decl_file   : 7
    <5e3>   DW_AT_decl_line   : 50
    <5e4>   DW_AT_decl_column : 12
    <5e5>   DW_AT_type        : <0xb6>
    <5e9>   DW_AT_data_member_location: 4
 <2><5ea>: Abbrev Number: 1 (DW_TAG_member)
    <5eb>   DW_AT_name        : (indirect string, offset: 0xa1b3c): PLLM
    <5ef>   DW_AT_decl_file   : 7
    <5f0>   DW_AT_decl_line   : 53
    <5f1>   DW_AT_decl_column : 12
    <5f2>   DW_AT_type        : <0xb6>
    <5f6>   DW_AT_data_member_location: 8
 <2><5f7>: Abbrev Number: 1 (DW_TAG_member)
    <5f8>   DW_AT_name        : (indirect string, offset: 0xa1b41): PLLN
    <5fc>   DW_AT_decl_file   : 7
    <5fd>   DW_AT_decl_line   : 56
    <5fe>   DW_AT_decl_column : 12
    <5ff>   DW_AT_type        : <0xb6>
    <603>   DW_AT_data_member_location: 12
 <2><604>: Abbrev Number: 1 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0xa1b5e): PLLP
    <609>   DW_AT_decl_file   : 7
    <60a>   DW_AT_decl_line   : 60
    <60b>   DW_AT_decl_column : 12
    <60c>   DW_AT_type        : <0xb6>
    <610>   DW_AT_data_member_location: 16
 <2><611>: Abbrev Number: 1 (DW_TAG_member)
    <612>   DW_AT_name        : (indirect string, offset: 0x491a0): PLLQ
    <616>   DW_AT_decl_file   : 7
    <617>   DW_AT_decl_line   : 63
    <618>   DW_AT_decl_column : 12
    <619>   DW_AT_type        : <0xb6>
    <61d>   DW_AT_data_member_location: 20
 <2><61e>: Abbrev Number: 0
 <1><61f>: Abbrev Number: 6 (DW_TAG_typedef)
    <620>   DW_AT_name        : (indirect string, offset: 0x76846): RCC_PLLInitTypeDef
    <624>   DW_AT_decl_file   : 7
    <625>   DW_AT_decl_line   : 73
    <626>   DW_AT_decl_column : 2
    <627>   DW_AT_type        : <0x5c8>
 <1><62b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <62c>   DW_AT_byte_size   : 48
    <62d>   DW_AT_decl_file   : 8
    <62e>   DW_AT_decl_line   : 49
    <62f>   DW_AT_decl_column : 9
    <62f>   DW_AT_sibling     : <0x68f>
 <2><633>: Abbrev Number: 1 (DW_TAG_member)
    <634>   DW_AT_name        : (indirect string, offset: 0x9ede3): OscillatorType
    <638>   DW_AT_decl_file   : 8
    <639>   DW_AT_decl_line   : 51
    <63a>   DW_AT_decl_column : 12
    <63b>   DW_AT_type        : <0xb6>
    <63f>   DW_AT_data_member_location: 0
 <2><640>: Abbrev Number: 1 (DW_TAG_member)
    <641>   DW_AT_name        : (indirect string, offset: 0x8434b): HSEState
    <645>   DW_AT_decl_file   : 8
    <646>   DW_AT_decl_line   : 54
    <647>   DW_AT_decl_column : 12
    <648>   DW_AT_type        : <0xb6>
    <64c>   DW_AT_data_member_location: 4
 <2><64d>: Abbrev Number: 1 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x7af79): LSEState
    <652>   DW_AT_decl_file   : 8
    <653>   DW_AT_decl_line   : 57
    <654>   DW_AT_decl_column : 12
    <655>   DW_AT_type        : <0xb6>
    <659>   DW_AT_data_member_location: 8
 <2><65a>: Abbrev Number: 1 (DW_TAG_member)
    <65b>   DW_AT_name        : (indirect string, offset: 0x5776d): HSIState
    <65f>   DW_AT_decl_file   : 8
    <660>   DW_AT_decl_line   : 60
    <661>   DW_AT_decl_column : 12
    <662>   DW_AT_type        : <0xb6>
    <666>   DW_AT_data_member_location: 12
 <2><667>: Abbrev Number: 1 (DW_TAG_member)
    <668>   DW_AT_name        : (indirect string, offset: 0xa7ba8): HSICalibrationValue
    <66c>   DW_AT_decl_file   : 8
    <66d>   DW_AT_decl_line   : 63
    <66e>   DW_AT_decl_column : 12
    <66f>   DW_AT_type        : <0xb6>
    <673>   DW_AT_data_member_location: 16
 <2><674>: Abbrev Number: 1 (DW_TAG_member)
    <675>   DW_AT_name        : (indirect string, offset: 0x44ebe): LSIState
    <679>   DW_AT_decl_file   : 8
    <67a>   DW_AT_decl_line   : 66
    <67b>   DW_AT_decl_column : 12
    <67c>   DW_AT_type        : <0xb6>
    <680>   DW_AT_data_member_location: 20
 <2><681>: Abbrev Number: 22 (DW_TAG_member)
    <682>   DW_AT_name        : PLL
    <686>   DW_AT_decl_file   : 8
    <687>   DW_AT_decl_line   : 69
    <688>   DW_AT_decl_column : 22
    <689>   DW_AT_type        : <0x61f>
    <68d>   DW_AT_data_member_location: 24
 <2><68e>: Abbrev Number: 0
 <1><68f>: Abbrev Number: 6 (DW_TAG_typedef)
    <690>   DW_AT_name        : (indirect string, offset: 0x68237): RCC_OscInitTypeDef
    <694>   DW_AT_decl_file   : 8
    <695>   DW_AT_decl_line   : 70
    <696>   DW_AT_decl_column : 2
    <697>   DW_AT_type        : <0x62b>
 <1><69b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <69c>   DW_AT_byte_size   : 20
    <69d>   DW_AT_decl_file   : 8
    <69e>   DW_AT_decl_line   : 75
    <69f>   DW_AT_decl_column : 9
    <69f>   DW_AT_sibling     : <0x6e5>
 <2><6a3>: Abbrev Number: 1 (DW_TAG_member)
    <6a4>   DW_AT_name        : (indirect string, offset: 0x3c559): ClockType
    <6a8>   DW_AT_decl_file   : 8
    <6a9>   DW_AT_decl_line   : 77
    <6aa>   DW_AT_decl_column : 12
    <6ab>   DW_AT_type        : <0xb6>
    <6af>   DW_AT_data_member_location: 0
 <2><6b0>: Abbrev Number: 1 (DW_TAG_member)
    <6b1>   DW_AT_name        : (indirect string, offset: 0x762c3): SYSCLKSource
    <6b5>   DW_AT_decl_file   : 8
    <6b6>   DW_AT_decl_line   : 80
    <6b7>   DW_AT_decl_column : 12
    <6b8>   DW_AT_type        : <0xb6>
    <6bc>   DW_AT_data_member_location: 4
 <2><6bd>: Abbrev Number: 1 (DW_TAG_member)
    <6be>   DW_AT_name        : (indirect string, offset: 0xa1588): AHBCLKDivider
    <6c2>   DW_AT_decl_file   : 8
    <6c3>   DW_AT_decl_line   : 83
    <6c4>   DW_AT_decl_column : 12
    <6c5>   DW_AT_type        : <0xb6>
    <6c9>   DW_AT_data_member_location: 8
 <2><6ca>: Abbrev Number: 1 (DW_TAG_member)
    <6cb>   DW_AT_name        : (indirect string, offset: 0x73cb): APB1CLKDivider
    <6cf>   DW_AT_decl_file   : 8
    <6d0>   DW_AT_decl_line   : 86
    <6d1>   DW_AT_decl_column : 12
    <6d2>   DW_AT_type        : <0xb6>
    <6d6>   DW_AT_data_member_location: 12
 <2><6d7>: Abbrev Number: 1 (DW_TAG_member)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x59e31): APB2CLKDivider
    <6dc>   DW_AT_decl_file   : 8
    <6dd>   DW_AT_decl_line   : 89
    <6de>   DW_AT_decl_column : 12
    <6df>   DW_AT_type        : <0xb6>
    <6e3>   DW_AT_data_member_location: 16
 <2><6e4>: Abbrev Number: 0
 <1><6e5>: Abbrev Number: 6 (DW_TAG_typedef)
    <6e6>   DW_AT_name        : (indirect string, offset: 0x8874c): RCC_ClkInitTypeDef
    <6ea>   DW_AT_decl_file   : 8
    <6eb>   DW_AT_decl_line   : 92
    <6ec>   DW_AT_decl_column : 2
    <6ed>   DW_AT_type        : <0x69b>
 <1><6f1>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6f2>   DW_AT_byte_size   : 20
    <6f3>   DW_AT_decl_file   : 9
    <6f4>   DW_AT_decl_line   : 46
    <6f5>   DW_AT_decl_column : 9
    <6f5>   DW_AT_sibling     : <0x73b>
 <2><6f9>: Abbrev Number: 22 (DW_TAG_member)
    <6fa>   DW_AT_name        : Pin
    <6fe>   DW_AT_decl_file   : 9
    <6ff>   DW_AT_decl_line   : 48
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xb6>
    <705>   DW_AT_data_member_location: 0
 <2><706>: Abbrev Number: 1 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0xc5e9c): Mode
    <70b>   DW_AT_decl_file   : 9
    <70c>   DW_AT_decl_line   : 51
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0xb6>
    <712>   DW_AT_data_member_location: 4
 <2><713>: Abbrev Number: 1 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0x64c85): Pull
    <718>   DW_AT_decl_file   : 9
    <719>   DW_AT_decl_line   : 54
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0xb6>
    <71f>   DW_AT_data_member_location: 8
 <2><720>: Abbrev Number: 1 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x72f38): Speed
    <725>   DW_AT_decl_file   : 9
    <726>   DW_AT_decl_line   : 57
    <727>   DW_AT_decl_column : 12
    <728>   DW_AT_type        : <0xb6>
    <72c>   DW_AT_data_member_location: 12
 <2><72d>: Abbrev Number: 1 (DW_TAG_member)
    <72e>   DW_AT_name        : (indirect string, offset: 0x59df2): Alternate
    <732>   DW_AT_decl_file   : 9
    <733>   DW_AT_decl_line   : 60
    <734>   DW_AT_decl_column : 12
    <735>   DW_AT_type        : <0xb6>
    <739>   DW_AT_data_member_location: 16
 <2><73a>: Abbrev Number: 0
 <1><73b>: Abbrev Number: 6 (DW_TAG_typedef)
    <73c>   DW_AT_name        : (indirect string, offset: 0x98a15): GPIO_InitTypeDef
    <740>   DW_AT_decl_file   : 9
    <741>   DW_AT_decl_line   : 62
    <742>   DW_AT_decl_column : 2
    <743>   DW_AT_type        : <0x6f1>
 <1><747>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <748>   DW_AT_encoding    : 7	(unsigned)
    <748>   DW_AT_byte_size   : 1
    <748>   DW_AT_type        : <0x3d>
    <74c>   DW_AT_decl_file   : 9
    <74d>   DW_AT_decl_line   : 68
    <74e>   DW_AT_decl_column : 1
    <74e>   DW_AT_sibling     : <0x75f>
 <2><752>: Abbrev Number: 4 (DW_TAG_enumerator)
    <753>   DW_AT_name        : (indirect string, offset: 0x28d57): GPIO_PIN_RESET
    <757>   DW_AT_const_value : 0
 <2><758>: Abbrev Number: 4 (DW_TAG_enumerator)
    <759>   DW_AT_name        : (indirect string, offset: 0x31a2b): GPIO_PIN_SET
    <75d>   DW_AT_const_value : 1
 <2><75e>: Abbrev Number: 0
 <1><75f>: Abbrev Number: 6 (DW_TAG_typedef)
    <760>   DW_AT_name        : (indirect string, offset: 0xbfdb2): GPIO_PinState
    <764>   DW_AT_decl_file   : 9
    <765>   DW_AT_decl_line   : 71
    <766>   DW_AT_decl_column : 2
    <767>   DW_AT_type        : <0x747>
 <1><76b>: Abbrev Number: 13 (DW_TAG_structure_type)
    <76c>   DW_AT_byte_size   : 48
    <76d>   DW_AT_decl_file   : 10
    <76e>   DW_AT_decl_line   : 48
    <76f>   DW_AT_decl_column : 9
    <76f>   DW_AT_sibling     : <0x810>
 <2><773>: Abbrev Number: 1 (DW_TAG_member)
    <774>   DW_AT_name        : (indirect string, offset: 0x65cca): Channel
    <778>   DW_AT_decl_file   : 10
    <779>   DW_AT_decl_line   : 50
    <77a>   DW_AT_decl_column : 12
    <77b>   DW_AT_type        : <0xb6>
    <77f>   DW_AT_data_member_location: 0
 <2><780>: Abbrev Number: 1 (DW_TAG_member)
    <781>   DW_AT_name        : (indirect string, offset: 0x48df7): Direction
    <785>   DW_AT_decl_file   : 10
    <786>   DW_AT_decl_line   : 53
    <787>   DW_AT_decl_column : 12
    <788>   DW_AT_type        : <0xb6>
    <78c>   DW_AT_data_member_location: 4
 <2><78d>: Abbrev Number: 1 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0xc8c3): PeriphInc
    <792>   DW_AT_decl_file   : 10
    <793>   DW_AT_decl_line   : 57
    <794>   DW_AT_decl_column : 12
    <795>   DW_AT_type        : <0xb6>
    <799>   DW_AT_data_member_location: 8
 <2><79a>: Abbrev Number: 1 (DW_TAG_member)
    <79b>   DW_AT_name        : (indirect string, offset: 0x1e9ef): MemInc
    <79f>   DW_AT_decl_file   : 10
    <7a0>   DW_AT_decl_line   : 60
    <7a1>   DW_AT_decl_column : 12
    <7a2>   DW_AT_type        : <0xb6>
    <7a6>   DW_AT_data_member_location: 12
 <2><7a7>: Abbrev Number: 1 (DW_TAG_member)
    <7a8>   DW_AT_name        : (indirect string, offset: 0x61404): PeriphDataAlignment
    <7ac>   DW_AT_decl_file   : 10
    <7ad>   DW_AT_decl_line   : 63
    <7ae>   DW_AT_decl_column : 12
    <7af>   DW_AT_type        : <0xb6>
    <7b3>   DW_AT_data_member_location: 16
 <2><7b4>: Abbrev Number: 1 (DW_TAG_member)
    <7b5>   DW_AT_name        : (indirect string, offset: 0xb08dc): MemDataAlignment
    <7b9>   DW_AT_decl_file   : 10
    <7ba>   DW_AT_decl_line   : 66
    <7bb>   DW_AT_decl_column : 12
    <7bc>   DW_AT_type        : <0xb6>
    <7c0>   DW_AT_data_member_location: 20
 <2><7c1>: Abbrev Number: 1 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0xc5e9c): Mode
    <7c6>   DW_AT_decl_file   : 10
    <7c7>   DW_AT_decl_line   : 69
    <7c8>   DW_AT_decl_column : 12
    <7c9>   DW_AT_type        : <0xb6>
    <7cd>   DW_AT_data_member_location: 24
 <2><7ce>: Abbrev Number: 1 (DW_TAG_member)
    <7cf>   DW_AT_name        : (indirect string, offset: 0xc4eed): Priority
    <7d3>   DW_AT_decl_file   : 10
    <7d4>   DW_AT_decl_line   : 74
    <7d5>   DW_AT_decl_column : 12
    <7d6>   DW_AT_type        : <0xb6>
    <7da>   DW_AT_data_member_location: 28
 <2><7db>: Abbrev Number: 1 (DW_TAG_member)
    <7dc>   DW_AT_name        : (indirect string, offset: 0x54958): FIFOMode
    <7e0>   DW_AT_decl_file   : 10
    <7e1>   DW_AT_decl_line   : 77
    <7e2>   DW_AT_decl_column : 12
    <7e3>   DW_AT_type        : <0xb6>
    <7e7>   DW_AT_data_member_location: 32
 <2><7e8>: Abbrev Number: 1 (DW_TAG_member)
    <7e9>   DW_AT_name        : (indirect string, offset: 0x945ea): FIFOThreshold
    <7ed>   DW_AT_decl_file   : 10
    <7ee>   DW_AT_decl_line   : 82
    <7ef>   DW_AT_decl_column : 12
    <7f0>   DW_AT_type        : <0xb6>
    <7f4>   DW_AT_data_member_location: 36
 <2><7f5>: Abbrev Number: 1 (DW_TAG_member)
    <7f6>   DW_AT_name        : (indirect string, offset: 0x928dd): MemBurst
    <7fa>   DW_AT_decl_file   : 10
    <7fb>   DW_AT_decl_line   : 85
    <7fc>   DW_AT_decl_column : 12
    <7fd>   DW_AT_type        : <0xb6>
    <801>   DW_AT_data_member_location: 40
 <2><802>: Abbrev Number: 1 (DW_TAG_member)
    <803>   DW_AT_name        : (indirect string, offset: 0x43564): PeriphBurst
    <807>   DW_AT_decl_file   : 10
    <808>   DW_AT_decl_line   : 91
    <809>   DW_AT_decl_column : 12
    <80a>   DW_AT_type        : <0xb6>
    <80e>   DW_AT_data_member_location: 44
 <2><80f>: Abbrev Number: 0
 <1><810>: Abbrev Number: 6 (DW_TAG_typedef)
    <811>   DW_AT_name        : (indirect string, offset: 0x34d5c): DMA_InitTypeDef
    <815>   DW_AT_decl_file   : 10
    <816>   DW_AT_decl_line   : 96
    <817>   DW_AT_decl_column : 2
    <818>   DW_AT_type        : <0x76b>
 <1><81c>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <81d>   DW_AT_encoding    : 7	(unsigned)
    <81d>   DW_AT_byte_size   : 1
    <81d>   DW_AT_type        : <0x3d>
    <821>   DW_AT_decl_file   : 10
    <822>   DW_AT_decl_line   : 103
    <823>   DW_AT_decl_column : 1
    <823>   DW_AT_sibling     : <0x84c>
 <2><827>: Abbrev Number: 4 (DW_TAG_enumerator)
    <828>   DW_AT_name        : (indirect string, offset: 0x91901): HAL_DMA_STATE_RESET
    <82c>   DW_AT_const_value : 0
 <2><82d>: Abbrev Number: 4 (DW_TAG_enumerator)
    <82e>   DW_AT_name        : (indirect string, offset: 0x360e7): HAL_DMA_STATE_READY
    <832>   DW_AT_const_value : 1
 <2><833>: Abbrev Number: 4 (DW_TAG_enumerator)
    <834>   DW_AT_name        : (indirect string, offset: 0x86dcc): HAL_DMA_STATE_BUSY
    <838>   DW_AT_const_value : 2
 <2><839>: Abbrev Number: 4 (DW_TAG_enumerator)
    <83a>   DW_AT_name        : (indirect string, offset: 0xc013c): HAL_DMA_STATE_TIMEOUT
    <83e>   DW_AT_const_value : 3
 <2><83f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <840>   DW_AT_name        : (indirect string, offset: 0x940cb): HAL_DMA_STATE_ERROR
    <844>   DW_AT_const_value : 4
 <2><845>: Abbrev Number: 4 (DW_TAG_enumerator)
    <846>   DW_AT_name        : (indirect string, offset: 0x4ccbd): HAL_DMA_STATE_ABORT
    <84a>   DW_AT_const_value : 5
 <2><84b>: Abbrev Number: 0
 <1><84c>: Abbrev Number: 6 (DW_TAG_typedef)
    <84d>   DW_AT_name        : (indirect string, offset: 0xafc59): HAL_DMA_StateTypeDef
    <851>   DW_AT_decl_file   : 10
    <852>   DW_AT_decl_line   : 110
    <853>   DW_AT_decl_column : 2
    <854>   DW_AT_type        : <0x81c>
 <1><858>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <859>   DW_AT_type        : <0x84c>
 <1><85d>: Abbrev Number: 25 (DW_TAG_structure_type)
    <85e>   DW_AT_name        : (indirect string, offset: 0xa5fe7): __DMA_HandleTypeDef
    <862>   DW_AT_byte_size   : 96
    <863>   DW_AT_decl_file   : 10
    <864>   DW_AT_decl_line   : 138
    <865>   DW_AT_decl_column : 16
    <865>   DW_AT_sibling     : <0x920>
 <2><869>: Abbrev Number: 1 (DW_TAG_member)
    <86a>   DW_AT_name        : (indirect string, offset: 0xbcddb): Instance
    <86e>   DW_AT_decl_file   : 10
    <86f>   DW_AT_decl_line   : 140
    <870>   DW_AT_decl_column : 31
    <871>   DW_AT_type        : <0x920>
    <875>   DW_AT_data_member_location: 0
 <2><876>: Abbrev Number: 1 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0xa1f86): Init
    <87b>   DW_AT_decl_file   : 10
    <87c>   DW_AT_decl_line   : 142
    <87d>   DW_AT_decl_column : 30
    <87e>   DW_AT_type        : <0x810>
    <882>   DW_AT_data_member_location: 4
 <2><883>: Abbrev Number: 1 (DW_TAG_member)
    <884>   DW_AT_name        : (indirect string, offset: 0x8af99): Lock
    <888>   DW_AT_decl_file   : 10
    <889>   DW_AT_decl_line   : 144
    <88a>   DW_AT_decl_column : 30
    <88b>   DW_AT_type        : <0x5bc>
    <88f>   DW_AT_data_member_location: 52
 <2><890>: Abbrev Number: 1 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x8434e): State
    <895>   DW_AT_decl_file   : 10
    <896>   DW_AT_decl_line   : 146
    <897>   DW_AT_decl_column : 30
    <898>   DW_AT_type        : <0x858>
    <89c>   DW_AT_data_member_location: 53
 <2><89d>: Abbrev Number: 1 (DW_TAG_member)
    <89e>   DW_AT_name        : (indirect string, offset: 0xb9d18): Parent
    <8a2>   DW_AT_decl_file   : 10
    <8a3>   DW_AT_decl_line   : 148
    <8a4>   DW_AT_decl_column : 31
    <8a5>   DW_AT_type        : <0x925>
    <8a9>   DW_AT_data_member_location: 56
 <2><8aa>: Abbrev Number: 1 (DW_TAG_member)
    <8ab>   DW_AT_name        : (indirect string, offset: 0xc25aa): XferCpltCallback
    <8af>   DW_AT_decl_file   : 10
    <8b0>   DW_AT_decl_line   : 150
    <8b1>   DW_AT_decl_column : 33
    <8b2>   DW_AT_type        : <0x937>
    <8b6>   DW_AT_data_member_location: 60
 <2><8b7>: Abbrev Number: 1 (DW_TAG_member)
    <8b8>   DW_AT_name        : (indirect string, offset: 0x97b2f): XferHalfCpltCallback
    <8bc>   DW_AT_decl_file   : 10
    <8bd>   DW_AT_decl_line   : 152
    <8be>   DW_AT_decl_column : 33
    <8bf>   DW_AT_type        : <0x937>
    <8c3>   DW_AT_data_member_location: 64
 <2><8c4>: Abbrev Number: 1 (DW_TAG_member)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x731ae): XferM1CpltCallback
    <8c9>   DW_AT_decl_file   : 10
    <8ca>   DW_AT_decl_line   : 154
    <8cb>   DW_AT_decl_column : 33
    <8cc>   DW_AT_type        : <0x937>
    <8d0>   DW_AT_data_member_location: 68
 <2><8d1>: Abbrev Number: 1 (DW_TAG_member)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x5e4b7): XferM1HalfCpltCallback
    <8d6>   DW_AT_decl_file   : 10
    <8d7>   DW_AT_decl_line   : 156
    <8d8>   DW_AT_decl_column : 33
    <8d9>   DW_AT_type        : <0x937>
    <8dd>   DW_AT_data_member_location: 72
 <2><8de>: Abbrev Number: 1 (DW_TAG_member)
    <8df>   DW_AT_name        : (indirect string, offset: 0x1c38a): XferErrorCallback
    <8e3>   DW_AT_decl_file   : 10
    <8e4>   DW_AT_decl_line   : 158
    <8e5>   DW_AT_decl_column : 33
    <8e6>   DW_AT_type        : <0x937>
    <8ea>   DW_AT_data_member_location: 76
 <2><8eb>: Abbrev Number: 1 (DW_TAG_member)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xb64eb): XferAbortCallback
    <8f0>   DW_AT_decl_file   : 10
    <8f1>   DW_AT_decl_line   : 160
    <8f2>   DW_AT_decl_column : 33
    <8f3>   DW_AT_type        : <0x937>
    <8f7>   DW_AT_data_member_location: 80
 <2><8f8>: Abbrev Number: 1 (DW_TAG_member)
    <8f9>   DW_AT_name        : (indirect string, offset: 0xbeee5): ErrorCode
    <8fd>   DW_AT_decl_file   : 10
    <8fe>   DW_AT_decl_line   : 162
    <8ff>   DW_AT_decl_column : 30
    <900>   DW_AT_type        : <0xc2>
    <904>   DW_AT_data_member_location: 84
 <2><905>: Abbrev Number: 1 (DW_TAG_member)
    <906>   DW_AT_name        : (indirect string, offset: 0x57b1b): StreamBaseAddress
    <90a>   DW_AT_decl_file   : 10
    <90b>   DW_AT_decl_line   : 164
    <90c>   DW_AT_decl_column : 30
    <90d>   DW_AT_type        : <0xb6>
    <911>   DW_AT_data_member_location: 88
 <2><912>: Abbrev Number: 1 (DW_TAG_member)
    <913>   DW_AT_name        : (indirect string, offset: 0xa41c0): StreamIndex
    <917>   DW_AT_decl_file   : 10
    <918>   DW_AT_decl_line   : 166
    <919>   DW_AT_decl_column : 30
    <91a>   DW_AT_type        : <0xb6>
    <91e>   DW_AT_data_member_location: 92
 <2><91f>: Abbrev Number: 0
 <1><920>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <921>   DW_AT_byte_size   : 4
    <921>   DW_AT_type        : <0x12e>
 <1><925>: Abbrev Number: 36 (DW_TAG_pointer_type)
    <926>   DW_AT_byte_size   : 4
 <1><927>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <928>   DW_AT_prototyped  : 1
    <928>   DW_AT_sibling     : <0x932>
 <2><92c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <92d>   DW_AT_type        : <0x932>
 <2><931>: Abbrev Number: 0
 <1><932>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <933>   DW_AT_byte_size   : 4
    <933>   DW_AT_type        : <0x85d>
 <1><937>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <938>   DW_AT_byte_size   : 4
    <938>   DW_AT_type        : <0x927>
 <1><93c>: Abbrev Number: 6 (DW_TAG_typedef)
    <93d>   DW_AT_name        : (indirect string, offset: 0xa5fe9): DMA_HandleTypeDef
    <941>   DW_AT_decl_file   : 10
    <942>   DW_AT_decl_line   : 168
    <943>   DW_AT_decl_column : 2
    <944>   DW_AT_type        : <0x85d>
 <1><948>: Abbrev Number: 13 (DW_TAG_structure_type)
    <949>   DW_AT_byte_size   : 44
    <94a>   DW_AT_decl_file   : 11
    <94b>   DW_AT_decl_line   : 46
    <94c>   DW_AT_decl_column : 9
    <94c>   DW_AT_sibling     : <0x9e0>
 <2><950>: Abbrev Number: 1 (DW_TAG_member)
    <951>   DW_AT_name        : (indirect string, offset: 0xc5e9c): Mode
    <955>   DW_AT_decl_file   : 11
    <956>   DW_AT_decl_line   : 48
    <957>   DW_AT_decl_column : 12
    <958>   DW_AT_type        : <0xb6>
    <95c>   DW_AT_data_member_location: 0
 <2><95d>: Abbrev Number: 1 (DW_TAG_member)
    <95e>   DW_AT_name        : (indirect string, offset: 0x48df7): Direction
    <962>   DW_AT_decl_file   : 11
    <963>   DW_AT_decl_line   : 51
    <964>   DW_AT_decl_column : 12
    <965>   DW_AT_type        : <0xb6>
    <969>   DW_AT_data_member_location: 4
 <2><96a>: Abbrev Number: 1 (DW_TAG_member)
    <96b>   DW_AT_name        : (indirect string, offset: 0x78a9c): DataSize
    <96f>   DW_AT_decl_file   : 11
    <970>   DW_AT_decl_line   : 54
    <971>   DW_AT_decl_column : 12
    <972>   DW_AT_type        : <0xb6>
    <976>   DW_AT_data_member_location: 8
 <2><977>: Abbrev Number: 1 (DW_TAG_member)
    <978>   DW_AT_name        : (indirect string, offset: 0x29318): CLKPolarity
    <97c>   DW_AT_decl_file   : 11
    <97d>   DW_AT_decl_line   : 57
    <97e>   DW_AT_decl_column : 12
    <97f>   DW_AT_type        : <0xb6>
    <983>   DW_AT_data_member_location: 12
 <2><984>: Abbrev Number: 1 (DW_TAG_member)
    <985>   DW_AT_name        : (indirect string, offset: 0x833f8): CLKPhase
    <989>   DW_AT_decl_file   : 11
    <98a>   DW_AT_decl_line   : 60
    <98b>   DW_AT_decl_column : 12
    <98c>   DW_AT_type        : <0xb6>
    <990>   DW_AT_data_member_location: 16
 <2><991>: Abbrev Number: 22 (DW_TAG_member)
    <992>   DW_AT_name        : NSS
    <996>   DW_AT_decl_file   : 11
    <997>   DW_AT_decl_line   : 63
    <998>   DW_AT_decl_column : 12
    <999>   DW_AT_type        : <0xb6>
    <99d>   DW_AT_data_member_location: 20
 <2><99e>: Abbrev Number: 1 (DW_TAG_member)
    <99f>   DW_AT_name        : (indirect string, offset: 0x1a341): BaudRatePrescaler
    <9a3>   DW_AT_decl_file   : 11
    <9a4>   DW_AT_decl_line   : 67
    <9a5>   DW_AT_decl_column : 12
    <9a6>   DW_AT_type        : <0xb6>
    <9aa>   DW_AT_data_member_location: 24
 <2><9ab>: Abbrev Number: 1 (DW_TAG_member)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xae76d): FirstBit
    <9b0>   DW_AT_decl_file   : 11
    <9b1>   DW_AT_decl_line   : 73
    <9b2>   DW_AT_decl_column : 12
    <9b3>   DW_AT_type        : <0xb6>
    <9b7>   DW_AT_data_member_location: 28
 <2><9b8>: Abbrev Number: 1 (DW_TAG_member)
    <9b9>   DW_AT_name        : (indirect string, offset: 0x7139c): TIMode
    <9bd>   DW_AT_decl_file   : 11
    <9be>   DW_AT_decl_line   : 76
    <9bf>   DW_AT_decl_column : 12
    <9c0>   DW_AT_type        : <0xb6>
    <9c4>   DW_AT_data_member_location: 32
 <2><9c5>: Abbrev Number: 1 (DW_TAG_member)
    <9c6>   DW_AT_name        : (indirect string, offset: 0x8b58d): CRCCalculation
    <9ca>   DW_AT_decl_file   : 11
    <9cb>   DW_AT_decl_line   : 79
    <9cc>   DW_AT_decl_column : 12
    <9cd>   DW_AT_type        : <0xb6>
    <9d1>   DW_AT_data_member_location: 36
 <2><9d2>: Abbrev Number: 1 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x6a36a): CRCPolynomial
    <9d7>   DW_AT_decl_file   : 11
    <9d8>   DW_AT_decl_line   : 82
    <9d9>   DW_AT_decl_column : 12
    <9da>   DW_AT_type        : <0xb6>
    <9de>   DW_AT_data_member_location: 40
 <2><9df>: Abbrev Number: 0
 <1><9e0>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x24c90): SPI_InitTypeDef
    <9e5>   DW_AT_decl_file   : 11
    <9e6>   DW_AT_decl_line   : 84
    <9e7>   DW_AT_decl_column : 3
    <9e8>   DW_AT_type        : <0x948>
 <1><9ec>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <9ed>   DW_AT_encoding    : 7	(unsigned)
    <9ed>   DW_AT_byte_size   : 1
    <9ed>   DW_AT_type        : <0x3d>
    <9f1>   DW_AT_decl_file   : 11
    <9f2>   DW_AT_decl_line   : 90
    <9f3>   DW_AT_decl_column : 1
    <9f3>   DW_AT_sibling     : <0xa28>
 <2><9f7>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x8119d): HAL_SPI_STATE_RESET
    <9fc>   DW_AT_const_value : 0
 <2><9fd>: Abbrev Number: 4 (DW_TAG_enumerator)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x2616c): HAL_SPI_STATE_READY
    <a02>   DW_AT_const_value : 1
 <2><a03>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a04>   DW_AT_name        : (indirect string, offset: 0xa4b82): HAL_SPI_STATE_BUSY
    <a08>   DW_AT_const_value : 2
 <2><a09>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x6abfa): HAL_SPI_STATE_BUSY_TX
    <a0e>   DW_AT_const_value : 3
 <2><a0f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a10>   DW_AT_name        : (indirect string, offset: 0x6a054): HAL_SPI_STATE_BUSY_RX
    <a14>   DW_AT_const_value : 4
 <2><a15>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a16>   DW_AT_name        : (indirect string, offset: 0x1e0e1): HAL_SPI_STATE_BUSY_TX_RX
    <a1a>   DW_AT_const_value : 5
 <2><a1b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x96e82): HAL_SPI_STATE_ERROR
    <a20>   DW_AT_const_value : 6
 <2><a21>: Abbrev Number: 4 (DW_TAG_enumerator)
    <a22>   DW_AT_name        : (indirect string, offset: 0x34f93): HAL_SPI_STATE_ABORT
    <a26>   DW_AT_const_value : 7
 <2><a27>: Abbrev Number: 0
 <1><a28>: Abbrev Number: 6 (DW_TAG_typedef)
    <a29>   DW_AT_name        : (indirect string, offset: 0xb070e): HAL_SPI_StateTypeDef
    <a2d>   DW_AT_decl_file   : 11
    <a2e>   DW_AT_decl_line   : 99
    <a2f>   DW_AT_decl_column : 3
    <a30>   DW_AT_type        : <0x9ec>
 <1><a34>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <a35>   DW_AT_type        : <0xa28>
 <1><a39>: Abbrev Number: 25 (DW_TAG_structure_type)
    <a3a>   DW_AT_name        : (indirect string, offset: 0xadc2d): __SPI_HandleTypeDef
    <a3e>   DW_AT_byte_size   : 88
    <a3f>   DW_AT_decl_file   : 11
    <a40>   DW_AT_decl_line   : 104
    <a41>   DW_AT_decl_column : 16
    <a41>   DW_AT_sibling     : <0xb09>
 <2><a45>: Abbrev Number: 1 (DW_TAG_member)
    <a46>   DW_AT_name        : (indirect string, offset: 0xbcddb): Instance
    <a4a>   DW_AT_decl_file   : 11
    <a4b>   DW_AT_decl_line   : 106
    <a4c>   DW_AT_decl_column : 31
    <a4d>   DW_AT_type        : <0xb09>
    <a51>   DW_AT_data_member_location: 0
 <2><a52>: Abbrev Number: 1 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0xa1f86): Init
    <a57>   DW_AT_decl_file   : 11
    <a58>   DW_AT_decl_line   : 108
    <a59>   DW_AT_decl_column : 30
    <a5a>   DW_AT_type        : <0x9e0>
    <a5e>   DW_AT_data_member_location: 4
 <2><a5f>: Abbrev Number: 1 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0x5dc4c): pTxBuffPtr
    <a64>   DW_AT_decl_file   : 11
    <a65>   DW_AT_decl_line   : 110
    <a66>   DW_AT_decl_column : 31
    <a67>   DW_AT_type        : <0xb0e>
    <a6b>   DW_AT_data_member_location: 48
 <2><a6c>: Abbrev Number: 1 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x52ac7): TxXferSize
    <a71>   DW_AT_decl_file   : 11
    <a72>   DW_AT_decl_line   : 112
    <a73>   DW_AT_decl_column : 30
    <a74>   DW_AT_type        : <0xa5>
    <a78>   DW_AT_data_member_location: 52
 <2><a79>: Abbrev Number: 1 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0xc592e): TxXferCount
    <a7e>   DW_AT_decl_file   : 11
    <a7f>   DW_AT_decl_line   : 114
    <a80>   DW_AT_decl_column : 30
    <a81>   DW_AT_type        : <0xb1>
    <a85>   DW_AT_data_member_location: 54
 <2><a86>: Abbrev Number: 1 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0xb55ea): pRxBuffPtr
    <a8b>   DW_AT_decl_file   : 11
    <a8c>   DW_AT_decl_line   : 116
    <a8d>   DW_AT_decl_column : 31
    <a8e>   DW_AT_type        : <0xb0e>
    <a92>   DW_AT_data_member_location: 56
 <2><a93>: Abbrev Number: 1 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0x614a0): RxXferSize
    <a98>   DW_AT_decl_file   : 11
    <a99>   DW_AT_decl_line   : 118
    <a9a>   DW_AT_decl_column : 30
    <a9b>   DW_AT_type        : <0xa5>
    <a9f>   DW_AT_data_member_location: 60
 <2><aa0>: Abbrev Number: 1 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x75b1c): RxXferCount
    <aa5>   DW_AT_decl_file   : 11
    <aa6>   DW_AT_decl_line   : 120
    <aa7>   DW_AT_decl_column : 30
    <aa8>   DW_AT_type        : <0xb1>
    <aac>   DW_AT_data_member_location: 62
 <2><aad>: Abbrev Number: 1 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0xc0d3e): RxISR
    <ab2>   DW_AT_decl_file   : 11
    <ab3>   DW_AT_decl_line   : 122
    <ab4>   DW_AT_decl_column : 10
    <ab5>   DW_AT_type        : <0xb23>
    <ab9>   DW_AT_data_member_location: 64
 <2><aba>: Abbrev Number: 1 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x620dd): TxISR
    <abf>   DW_AT_decl_file   : 11
    <ac0>   DW_AT_decl_line   : 124
    <ac1>   DW_AT_decl_column : 10
    <ac2>   DW_AT_type        : <0xb23>
    <ac6>   DW_AT_data_member_location: 68
 <2><ac7>: Abbrev Number: 1 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0xbe3c7): hdmatx
    <acc>   DW_AT_decl_file   : 11
    <acd>   DW_AT_decl_line   : 126
    <ace>   DW_AT_decl_column : 31
    <acf>   DW_AT_type        : <0xb28>
    <ad3>   DW_AT_data_member_location: 72
 <2><ad4>: Abbrev Number: 1 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xbd71b): hdmarx
    <ad9>   DW_AT_decl_file   : 11
    <ada>   DW_AT_decl_line   : 128
    <adb>   DW_AT_decl_column : 31
    <adc>   DW_AT_type        : <0xb28>
    <ae0>   DW_AT_data_member_location: 76
 <2><ae1>: Abbrev Number: 1 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x8af99): Lock
    <ae6>   DW_AT_decl_file   : 11
    <ae7>   DW_AT_decl_line   : 130
    <ae8>   DW_AT_decl_column : 30
    <ae9>   DW_AT_type        : <0x5bc>
    <aed>   DW_AT_data_member_location: 80
 <2><aee>: Abbrev Number: 1 (DW_TAG_member)
    <aef>   DW_AT_name        : (indirect string, offset: 0x8434e): State
    <af3>   DW_AT_decl_file   : 11
    <af4>   DW_AT_decl_line   : 132
    <af5>   DW_AT_decl_column : 30
    <af6>   DW_AT_type        : <0xa34>
    <afa>   DW_AT_data_member_location: 81
 <2><afb>: Abbrev Number: 1 (DW_TAG_member)
    <afc>   DW_AT_name        : (indirect string, offset: 0xbeee5): ErrorCode
    <b00>   DW_AT_decl_file   : 11
    <b01>   DW_AT_decl_line   : 134
    <b02>   DW_AT_decl_column : 30
    <b03>   DW_AT_type        : <0xc2>
    <b07>   DW_AT_data_member_location: 84
 <2><b08>: Abbrev Number: 0
 <1><b09>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b0a>   DW_AT_byte_size   : 4
    <b0a>   DW_AT_type        : <0x43b>
 <1><b0e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b0f>   DW_AT_byte_size   : 4
    <b0f>   DW_AT_type        : <0x94>
 <1><b13>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <b14>   DW_AT_prototyped  : 1
    <b14>   DW_AT_sibling     : <0xb1e>
 <2><b18>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <b19>   DW_AT_type        : <0xb1e>
 <2><b1d>: Abbrev Number: 0
 <1><b1e>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b1f>   DW_AT_byte_size   : 4
    <b1f>   DW_AT_type        : <0xa39>
 <1><b23>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b24>   DW_AT_byte_size   : 4
    <b24>   DW_AT_type        : <0xb13>
 <1><b28>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <b29>   DW_AT_byte_size   : 4
    <b29>   DW_AT_type        : <0x93c>
 <1><b2d>: Abbrev Number: 6 (DW_TAG_typedef)
    <b2e>   DW_AT_name        : (indirect string, offset: 0xadc2f): SPI_HandleTypeDef
    <b32>   DW_AT_decl_file   : 11
    <b33>   DW_AT_decl_line   : 149
    <b34>   DW_AT_decl_column : 3
    <b35>   DW_AT_type        : <0xa39>
 <1><b39>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b3a>   DW_AT_byte_size   : 24
    <b3b>   DW_AT_decl_file   : 12
    <b3c>   DW_AT_decl_line   : 46
    <b3d>   DW_AT_decl_column : 9
    <b3d>   DW_AT_sibling     : <0xb90>
 <2><b41>: Abbrev Number: 1 (DW_TAG_member)
    <b42>   DW_AT_name        : (indirect string, offset: 0x64fb3): Prescaler
    <b46>   DW_AT_decl_file   : 12
    <b47>   DW_AT_decl_line   : 48
    <b48>   DW_AT_decl_column : 12
    <b49>   DW_AT_type        : <0xb6>
    <b4d>   DW_AT_data_member_location: 0
 <2><b4e>: Abbrev Number: 1 (DW_TAG_member)
    <b4f>   DW_AT_name        : (indirect string, offset: 0xb154d): CounterMode
    <b53>   DW_AT_decl_file   : 12
    <b54>   DW_AT_decl_line   : 51
    <b55>   DW_AT_decl_column : 12
    <b56>   DW_AT_type        : <0xb6>
    <b5a>   DW_AT_data_member_location: 4
 <2><b5b>: Abbrev Number: 1 (DW_TAG_member)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x982ea): Period
    <b60>   DW_AT_decl_file   : 12
    <b61>   DW_AT_decl_line   : 54
    <b62>   DW_AT_decl_column : 12
    <b63>   DW_AT_type        : <0xb6>
    <b67>   DW_AT_data_member_location: 8
 <2><b68>: Abbrev Number: 1 (DW_TAG_member)
    <b69>   DW_AT_name        : (indirect string, offset: 0x4fda5): ClockDivision
    <b6d>   DW_AT_decl_file   : 12
    <b6e>   DW_AT_decl_line   : 58
    <b6f>   DW_AT_decl_column : 12
    <b70>   DW_AT_type        : <0xb6>
    <b74>   DW_AT_data_member_location: 12
 <2><b75>: Abbrev Number: 1 (DW_TAG_member)
    <b76>   DW_AT_name        : (indirect string, offset: 0x8853b): RepetitionCounter
    <b7a>   DW_AT_decl_file   : 12
    <b7b>   DW_AT_decl_line   : 61
    <b7c>   DW_AT_decl_column : 12
    <b7d>   DW_AT_type        : <0xb6>
    <b81>   DW_AT_data_member_location: 16
 <2><b82>: Abbrev Number: 1 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xb4101): AutoReloadPreload
    <b87>   DW_AT_decl_file   : 12
    <b88>   DW_AT_decl_line   : 72
    <b89>   DW_AT_decl_column : 12
    <b8a>   DW_AT_type        : <0xb6>
    <b8e>   DW_AT_data_member_location: 20
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 6 (DW_TAG_typedef)
    <b91>   DW_AT_name        : (indirect string, offset: 0x43e77): TIM_Base_InitTypeDef
    <b95>   DW_AT_decl_file   : 12
    <b96>   DW_AT_decl_line   : 74
    <b97>   DW_AT_decl_column : 3
    <b98>   DW_AT_type        : <0xb39>
 <1><b9c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b9d>   DW_AT_byte_size   : 36
    <b9e>   DW_AT_decl_file   : 12
    <b9f>   DW_AT_decl_line   : 165
    <ba0>   DW_AT_decl_column : 9
    <ba0>   DW_AT_sibling     : <0xc1a>
 <2><ba4>: Abbrev Number: 1 (DW_TAG_member)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x1f543): EncoderMode
    <ba9>   DW_AT_decl_file   : 12
    <baa>   DW_AT_decl_line   : 167
    <bab>   DW_AT_decl_column : 12
    <bac>   DW_AT_type        : <0xb6>
    <bb0>   DW_AT_data_member_location: 0
 <2><bb1>: Abbrev Number: 1 (DW_TAG_member)
    <bb2>   DW_AT_name        : (indirect string, offset: 0xbf8f3): IC1Polarity
    <bb6>   DW_AT_decl_file   : 12
    <bb7>   DW_AT_decl_line   : 170
    <bb8>   DW_AT_decl_column : 12
    <bb9>   DW_AT_type        : <0xb6>
    <bbd>   DW_AT_data_member_location: 4
 <2><bbe>: Abbrev Number: 1 (DW_TAG_member)
    <bbf>   DW_AT_name        : (indirect string, offset: 0xbff8b): IC1Selection
    <bc3>   DW_AT_decl_file   : 12
    <bc4>   DW_AT_decl_line   : 173
    <bc5>   DW_AT_decl_column : 12
    <bc6>   DW_AT_type        : <0xb6>
    <bca>   DW_AT_data_member_location: 8
 <2><bcb>: Abbrev Number: 1 (DW_TAG_member)
    <bcc>   DW_AT_name        : (indirect string, offset: 0x64fb0): IC1Prescaler
    <bd0>   DW_AT_decl_file   : 12
    <bd1>   DW_AT_decl_line   : 176
    <bd2>   DW_AT_decl_column : 12
    <bd3>   DW_AT_type        : <0xb6>
    <bd7>   DW_AT_data_member_location: 12
 <2><bd8>: Abbrev Number: 1 (DW_TAG_member)
    <bd9>   DW_AT_name        : (indirect string, offset: 0x151d3): IC1Filter
    <bdd>   DW_AT_decl_file   : 12
    <bde>   DW_AT_decl_line   : 179
    <bdf>   DW_AT_decl_column : 12
    <be0>   DW_AT_type        : <0xb6>
    <be4>   DW_AT_data_member_location: 16
 <2><be5>: Abbrev Number: 1 (DW_TAG_member)
    <be6>   DW_AT_name        : (indirect string, offset: 0x9385e): IC2Polarity
    <bea>   DW_AT_decl_file   : 12
    <beb>   DW_AT_decl_line   : 182
    <bec>   DW_AT_decl_column : 12
    <bed>   DW_AT_type        : <0xb6>
    <bf1>   DW_AT_data_member_location: 20
 <2><bf2>: Abbrev Number: 1 (DW_TAG_member)
    <bf3>   DW_AT_name        : (indirect string, offset: 0xbaaba): IC2Selection
    <bf7>   DW_AT_decl_file   : 12
    <bf8>   DW_AT_decl_line   : 185
    <bf9>   DW_AT_decl_column : 12
    <bfa>   DW_AT_type        : <0xb6>
    <bfe>   DW_AT_data_member_location: 24
 <2><bff>: Abbrev Number: 1 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0x5fd75): IC2Prescaler
    <c04>   DW_AT_decl_file   : 12
    <c05>   DW_AT_decl_line   : 188
    <c06>   DW_AT_decl_column : 12
    <c07>   DW_AT_type        : <0xb6>
    <c0b>   DW_AT_data_member_location: 28
 <2><c0c>: Abbrev Number: 1 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x68400): IC2Filter
    <c11>   DW_AT_decl_file   : 12
    <c12>   DW_AT_decl_line   : 191
    <c13>   DW_AT_decl_column : 12
    <c14>   DW_AT_type        : <0xb6>
    <c18>   DW_AT_data_member_location: 32
 <2><c19>: Abbrev Number: 0
 <1><c1a>: Abbrev Number: 6 (DW_TAG_typedef)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x2d81e): TIM_Encoder_InitTypeDef
    <c1f>   DW_AT_decl_file   : 12
    <c20>   DW_AT_decl_line   : 193
    <c21>   DW_AT_decl_column : 3
    <c22>   DW_AT_type        : <0xb9c>
 <1><c26>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c27>   DW_AT_byte_size   : 16
    <c28>   DW_AT_decl_file   : 12
    <c29>   DW_AT_decl_line   : 198
    <c2a>   DW_AT_decl_column : 9
    <c2a>   DW_AT_sibling     : <0xc63>
 <2><c2e>: Abbrev Number: 1 (DW_TAG_member)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x1cfcb): ClockSource
    <c33>   DW_AT_decl_file   : 12
    <c34>   DW_AT_decl_line   : 200
    <c35>   DW_AT_decl_column : 12
    <c36>   DW_AT_type        : <0xb6>
    <c3a>   DW_AT_data_member_location: 0
 <2><c3b>: Abbrev Number: 1 (DW_TAG_member)
    <c3c>   DW_AT_name        : (indirect string, offset: 0x6c4cb): ClockPolarity
    <c40>   DW_AT_decl_file   : 12
    <c41>   DW_AT_decl_line   : 202
    <c42>   DW_AT_decl_column : 12
    <c43>   DW_AT_type        : <0xb6>
    <c47>   DW_AT_data_member_location: 4
 <2><c48>: Abbrev Number: 1 (DW_TAG_member)
    <c49>   DW_AT_name        : (indirect string, offset: 0xac414): ClockPrescaler
    <c4d>   DW_AT_decl_file   : 12
    <c4e>   DW_AT_decl_line   : 204
    <c4f>   DW_AT_decl_column : 12
    <c50>   DW_AT_type        : <0xb6>
    <c54>   DW_AT_data_member_location: 8
 <2><c55>: Abbrev Number: 1 (DW_TAG_member)
    <c56>   DW_AT_name        : (indirect string, offset: 0x7ded7): ClockFilter
    <c5a>   DW_AT_decl_file   : 12
    <c5b>   DW_AT_decl_line   : 206
    <c5c>   DW_AT_decl_column : 12
    <c5d>   DW_AT_type        : <0xb6>
    <c61>   DW_AT_data_member_location: 12
 <2><c62>: Abbrev Number: 0
 <1><c63>: Abbrev Number: 6 (DW_TAG_typedef)
    <c64>   DW_AT_name        : (indirect string, offset: 0x5ed7): TIM_ClockConfigTypeDef
    <c68>   DW_AT_decl_file   : 12
    <c69>   DW_AT_decl_line   : 208
    <c6a>   DW_AT_decl_column : 3
    <c6b>   DW_AT_type        : <0xc26>
 <1><c6f>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c70>   DW_AT_byte_size   : 8
    <c71>   DW_AT_decl_file   : 12
    <c72>   DW_AT_decl_line   : 231
    <c73>   DW_AT_decl_column : 9
    <c73>   DW_AT_sibling     : <0xc92>
 <2><c77>: Abbrev Number: 1 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0x73ae8): MasterOutputTrigger
    <c7c>   DW_AT_decl_file   : 12
    <c7d>   DW_AT_decl_line   : 233
    <c7e>   DW_AT_decl_column : 13
    <c7f>   DW_AT_type        : <0xb6>
    <c83>   DW_AT_data_member_location: 0
 <2><c84>: Abbrev Number: 1 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x6700e): MasterSlaveMode
    <c89>   DW_AT_decl_file   : 12
    <c8a>   DW_AT_decl_line   : 235
    <c8b>   DW_AT_decl_column : 13
    <c8c>   DW_AT_type        : <0xb6>
    <c90>   DW_AT_data_member_location: 4
 <2><c91>: Abbrev Number: 0
 <1><c92>: Abbrev Number: 6 (DW_TAG_typedef)
    <c93>   DW_AT_name        : (indirect string, offset: 0x8d00d): TIM_MasterConfigTypeDef
    <c97>   DW_AT_decl_file   : 12
    <c98>   DW_AT_decl_line   : 242
    <c99>   DW_AT_decl_column : 3
    <c9a>   DW_AT_type        : <0xc6f>
 <1><c9e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c9f>   DW_AT_byte_size   : 20
    <ca0>   DW_AT_decl_file   : 12
    <ca1>   DW_AT_decl_line   : 247
    <ca2>   DW_AT_decl_column : 9
    <ca2>   DW_AT_sibling     : <0xce9>
 <2><ca6>: Abbrev Number: 1 (DW_TAG_member)
    <ca7>   DW_AT_name        : (indirect string, offset: 0x67014): SlaveMode
    <cab>   DW_AT_decl_file   : 12
    <cac>   DW_AT_decl_line   : 249
    <cad>   DW_AT_decl_column : 13
    <cae>   DW_AT_type        : <0xb6>
    <cb2>   DW_AT_data_member_location: 0
 <2><cb3>: Abbrev Number: 1 (DW_TAG_member)
    <cb4>   DW_AT_name        : (indirect string, offset: 0xae7e2): InputTrigger
    <cb8>   DW_AT_decl_file   : 12
    <cb9>   DW_AT_decl_line   : 251
    <cba>   DW_AT_decl_column : 13
    <cbb>   DW_AT_type        : <0xb6>
    <cbf>   DW_AT_data_member_location: 4
 <2><cc0>: Abbrev Number: 1 (DW_TAG_member)
    <cc1>   DW_AT_name        : (indirect string, offset: 0xbee64): TriggerPolarity
    <cc5>   DW_AT_decl_file   : 12
    <cc6>   DW_AT_decl_line   : 253
    <cc7>   DW_AT_decl_column : 13
    <cc8>   DW_AT_type        : <0xb6>
    <ccc>   DW_AT_data_member_location: 8
 <2><ccd>: Abbrev Number: 1 (DW_TAG_member)
    <cce>   DW_AT_name        : (indirect string, offset: 0x58347): TriggerPrescaler
    <cd2>   DW_AT_decl_file   : 12
    <cd3>   DW_AT_decl_line   : 255
    <cd4>   DW_AT_decl_column : 13
    <cd5>   DW_AT_type        : <0xb6>
    <cd9>   DW_AT_data_member_location: 12
 <2><cda>: Abbrev Number: 2 (DW_TAG_member)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x9427a): TriggerFilter
    <cdf>   DW_AT_decl_file   : 12
    <ce0>   DW_AT_decl_line   : 257
    <ce2>   DW_AT_decl_column : 13
    <ce3>   DW_AT_type        : <0xb6>
    <ce7>   DW_AT_data_member_location: 16
 <2><ce8>: Abbrev Number: 0
 <1><ce9>: Abbrev Number: 11 (DW_TAG_typedef)
    <cea>   DW_AT_name        : (indirect string, offset: 0x4e795): TIM_SlaveConfigTypeDef
    <cee>   DW_AT_decl_file   : 12
    <cef>   DW_AT_decl_line   : 260
    <cf1>   DW_AT_decl_column : 3
    <cf1>   DW_AT_type        : <0xc9e>
 <1><cf5>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <cf6>   DW_AT_encoding    : 7	(unsigned)
    <cf6>   DW_AT_byte_size   : 1
    <cf6>   DW_AT_type        : <0x3d>
    <cfa>   DW_AT_decl_file   : 12
    <cfa>   DW_AT_decl_line   : 291
    <cfc>   DW_AT_decl_column : 1
    <cfc>   DW_AT_sibling     : <0xd1f>
 <2><d00>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d01>   DW_AT_name        : (indirect string, offset: 0x7ab6b): HAL_TIM_STATE_RESET
    <d05>   DW_AT_const_value : 0
 <2><d06>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d07>   DW_AT_name        : (indirect string, offset: 0x6a63): HAL_TIM_STATE_READY
    <d0b>   DW_AT_const_value : 1
 <2><d0c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d0d>   DW_AT_name        : (indirect string, offset: 0x319c5): HAL_TIM_STATE_BUSY
    <d11>   DW_AT_const_value : 2
 <2><d12>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d13>   DW_AT_name        : (indirect string, offset: 0xa32b3): HAL_TIM_STATE_TIMEOUT
    <d17>   DW_AT_const_value : 3
 <2><d18>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d19>   DW_AT_name        : (indirect string, offset: 0x78d98): HAL_TIM_STATE_ERROR
    <d1d>   DW_AT_const_value : 4
 <2><d1e>: Abbrev Number: 0
 <1><d1f>: Abbrev Number: 11 (DW_TAG_typedef)
    <d20>   DW_AT_name        : (indirect string, offset: 0x80372): HAL_TIM_StateTypeDef
    <d24>   DW_AT_decl_file   : 12
    <d25>   DW_AT_decl_line   : 297
    <d27>   DW_AT_decl_column : 3
    <d27>   DW_AT_type        : <0xcf5>
 <1><d2b>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d2c>   DW_AT_type        : <0xd1f>
 <1><d30>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d31>   DW_AT_encoding    : 7	(unsigned)
    <d31>   DW_AT_byte_size   : 1
    <d31>   DW_AT_type        : <0x3d>
    <d35>   DW_AT_decl_file   : 12
    <d35>   DW_AT_decl_line   : 303
    <d37>   DW_AT_decl_column : 1
    <d37>   DW_AT_sibling     : <0xd4e>
 <2><d3b>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d3c>   DW_AT_name        : (indirect string, offset: 0xa8e5): HAL_TIM_CHANNEL_STATE_RESET
    <d40>   DW_AT_const_value : 0
 <2><d41>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d42>   DW_AT_name        : (indirect string, offset: 0x734a0): HAL_TIM_CHANNEL_STATE_READY
    <d46>   DW_AT_const_value : 1
 <2><d47>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d48>   DW_AT_name        : (indirect string, offset: 0x5e664): HAL_TIM_CHANNEL_STATE_BUSY
    <d4c>   DW_AT_const_value : 2
 <2><d4d>: Abbrev Number: 0
 <1><d4e>: Abbrev Number: 11 (DW_TAG_typedef)
    <d4f>   DW_AT_name        : (indirect string, offset: 0x296d2): HAL_TIM_ChannelStateTypeDef
    <d53>   DW_AT_decl_file   : 12
    <d54>   DW_AT_decl_line   : 307
    <d56>   DW_AT_decl_column : 3
    <d56>   DW_AT_type        : <0xd30>
 <1><d5a>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d5b>   DW_AT_type        : <0xd4e>
 <1><d5f>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d60>   DW_AT_encoding    : 7	(unsigned)
    <d60>   DW_AT_byte_size   : 1
    <d60>   DW_AT_type        : <0x3d>
    <d64>   DW_AT_decl_file   : 12
    <d64>   DW_AT_decl_line   : 313
    <d66>   DW_AT_decl_column : 1
    <d66>   DW_AT_sibling     : <0xd7d>
 <2><d6a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x3c37): HAL_DMA_BURST_STATE_RESET
    <d6f>   DW_AT_const_value : 0
 <2><d70>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d71>   DW_AT_name        : (indirect string, offset: 0x6c14c): HAL_DMA_BURST_STATE_READY
    <d75>   DW_AT_const_value : 1
 <2><d76>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0x426ab): HAL_DMA_BURST_STATE_BUSY
    <d7b>   DW_AT_const_value : 2
 <2><d7c>: Abbrev Number: 0
 <1><d7d>: Abbrev Number: 11 (DW_TAG_typedef)
    <d7e>   DW_AT_name        : (indirect string, offset: 0x1a8fe): HAL_TIM_DMABurstStateTypeDef
    <d82>   DW_AT_decl_file   : 12
    <d83>   DW_AT_decl_line   : 317
    <d85>   DW_AT_decl_column : 3
    <d85>   DW_AT_type        : <0xd5f>
 <1><d89>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d8a>   DW_AT_type        : <0xd7d>
 <1><d8e>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <d8f>   DW_AT_encoding    : 7	(unsigned)
    <d8f>   DW_AT_byte_size   : 1
    <d8f>   DW_AT_type        : <0x3d>
    <d93>   DW_AT_decl_file   : 12
    <d93>   DW_AT_decl_line   : 323
    <d95>   DW_AT_decl_column : 1
    <d95>   DW_AT_sibling     : <0xdb8>
 <2><d99>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x6e0f2): HAL_TIM_ACTIVE_CHANNEL_1
    <d9e>   DW_AT_const_value : 1
 <2><d9f>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x6e10b): HAL_TIM_ACTIVE_CHANNEL_2
    <da4>   DW_AT_const_value : 2
 <2><da5>: Abbrev Number: 4 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x6e124): HAL_TIM_ACTIVE_CHANNEL_3
    <daa>   DW_AT_const_value : 4
 <2><dab>: Abbrev Number: 4 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0x6e13d): HAL_TIM_ACTIVE_CHANNEL_4
    <db0>   DW_AT_const_value : 8
 <2><db1>: Abbrev Number: 4 (DW_TAG_enumerator)
    <db2>   DW_AT_name        : (indirect string, offset: 0x50f3a): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <db6>   DW_AT_const_value : 0
 <2><db7>: Abbrev Number: 0
 <1><db8>: Abbrev Number: 11 (DW_TAG_typedef)
    <db9>   DW_AT_name        : (indirect string, offset: 0x65cbc): HAL_TIM_ActiveChannel
    <dbd>   DW_AT_decl_file   : 12
    <dbe>   DW_AT_decl_line   : 329
    <dc0>   DW_AT_decl_column : 3
    <dc0>   DW_AT_type        : <0xd8e>
 <1><dc4>: Abbrev Number: 15 (DW_TAG_structure_type)
    <dc5>   DW_AT_byte_size   : 72
    <dc6>   DW_AT_decl_file   : 12
    <dc7>   DW_AT_decl_line   : 337
    <dc9>   DW_AT_decl_column : 9
    <dc9>   DW_AT_sibling     : <0xe4c>
 <2><dcd>: Abbrev Number: 2 (DW_TAG_member)
    <dce>   DW_AT_name        : (indirect string, offset: 0xbcddb): Instance
    <dd2>   DW_AT_decl_file   : 12
    <dd3>   DW_AT_decl_line   : 340
    <dd5>   DW_AT_decl_column : 39
    <dd6>   DW_AT_type        : <0xe4c>
    <dda>   DW_AT_data_member_location: 0
 <2><ddb>: Abbrev Number: 2 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xa1f86): Init
    <de0>   DW_AT_decl_file   : 12
    <de1>   DW_AT_decl_line   : 341
    <de3>   DW_AT_decl_column : 38
    <de4>   DW_AT_type        : <0xb90>
    <de8>   DW_AT_data_member_location: 4
 <2><de9>: Abbrev Number: 2 (DW_TAG_member)
    <dea>   DW_AT_name        : (indirect string, offset: 0x65cca): Channel
    <dee>   DW_AT_decl_file   : 12
    <def>   DW_AT_decl_line   : 342
    <df1>   DW_AT_decl_column : 38
    <df2>   DW_AT_type        : <0xdb8>
    <df6>   DW_AT_data_member_location: 28
 <2><df7>: Abbrev Number: 2 (DW_TAG_member)
    <df8>   DW_AT_name        : (indirect string, offset: 0x75964): hdma
    <dfc>   DW_AT_decl_file   : 12
    <dfd>   DW_AT_decl_line   : 343
    <dff>   DW_AT_decl_column : 39
    <e00>   DW_AT_type        : <0xe51>
    <e04>   DW_AT_data_member_location: 32
 <2><e05>: Abbrev Number: 2 (DW_TAG_member)
    <e06>   DW_AT_name        : (indirect string, offset: 0x8af99): Lock
    <e0a>   DW_AT_decl_file   : 12
    <e0b>   DW_AT_decl_line   : 345
    <e0d>   DW_AT_decl_column : 38
    <e0e>   DW_AT_type        : <0x5bc>
    <e12>   DW_AT_data_member_location: 60
 <2><e13>: Abbrev Number: 2 (DW_TAG_member)
    <e14>   DW_AT_name        : (indirect string, offset: 0x8434e): State
    <e18>   DW_AT_decl_file   : 12
    <e19>   DW_AT_decl_line   : 346
    <e1b>   DW_AT_decl_column : 38
    <e1c>   DW_AT_type        : <0xd2b>
    <e20>   DW_AT_data_member_location: 61
 <2><e21>: Abbrev Number: 2 (DW_TAG_member)
    <e22>   DW_AT_name        : (indirect string, offset: 0xc64f0): ChannelState
    <e26>   DW_AT_decl_file   : 12
    <e27>   DW_AT_decl_line   : 347
    <e29>   DW_AT_decl_column : 38
    <e2a>   DW_AT_type        : <0xe71>
    <e2e>   DW_AT_data_member_location: 62
 <2><e2f>: Abbrev Number: 2 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0xc6a4c): ChannelNState
    <e34>   DW_AT_decl_file   : 12
    <e35>   DW_AT_decl_line   : 348
    <e37>   DW_AT_decl_column : 38
    <e38>   DW_AT_type        : <0xe71>
    <e3c>   DW_AT_data_member_location: 66
 <2><e3d>: Abbrev Number: 2 (DW_TAG_member)
    <e3e>   DW_AT_name        : (indirect string, offset: 0xc60b9): DMABurstState
    <e42>   DW_AT_decl_file   : 12
    <e43>   DW_AT_decl_line   : 349
    <e45>   DW_AT_decl_column : 38
    <e46>   DW_AT_type        : <0xd89>
    <e4a>   DW_AT_data_member_location: 70
 <2><e4b>: Abbrev Number: 0
 <1><e4c>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <e4d>   DW_AT_byte_size   : 4
    <e4d>   DW_AT_type        : <0x561>
 <1><e51>: Abbrev Number: 18 (DW_TAG_array_type)
    <e52>   DW_AT_type        : <0xb28>
    <e56>   DW_AT_sibling     : <0xe61>
 <2><e5a>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <e5b>   DW_AT_type        : <0x8d>
    <e5f>   DW_AT_upper_bound : 6
 <2><e60>: Abbrev Number: 0
 <1><e61>: Abbrev Number: 18 (DW_TAG_array_type)
    <e62>   DW_AT_type        : <0xd5a>
    <e66>   DW_AT_sibling     : <0xe71>
 <2><e6a>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <e6b>   DW_AT_type        : <0x8d>
    <e6f>   DW_AT_upper_bound : 3
 <2><e70>: Abbrev Number: 0
 <1><e71>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <e72>   DW_AT_type        : <0xe61>
 <1><e76>: Abbrev Number: 11 (DW_TAG_typedef)
    <e77>   DW_AT_name        : (indirect string, offset: 0x438c3): TIM_HandleTypeDef
    <e7b>   DW_AT_decl_file   : 12
    <e7c>   DW_AT_decl_line   : 380
    <e7e>   DW_AT_decl_column : 3
    <e7e>   DW_AT_type        : <0xdc4>
 <1><e82>: Abbrev Number: 3 (DW_TAG_variable)
    <e83>   DW_AT_name        : (indirect string, offset: 0x52d96): hspi3
    <e87>   DW_AT_decl_file   : 1
    <e87>   DW_AT_decl_line   : 43
    <e88>   DW_AT_decl_column : 19
    <e89>   DW_AT_type        : <0xb2d>
    <e8d>   DW_AT_external    : 1
    <e8d>   DW_AT_location    : 5 byte block: 3 44 0 0 20 	(DW_OP_addr: 20000044)
 <1><e93>: Abbrev Number: 3 (DW_TAG_variable)
    <e94>   DW_AT_name        : (indirect string, offset: 0xae26e): htim1
    <e98>   DW_AT_decl_file   : 1
    <e98>   DW_AT_decl_line   : 45
    <e99>   DW_AT_decl_column : 19
    <e9a>   DW_AT_type        : <0xe76>
    <e9e>   DW_AT_external    : 1
    <e9e>   DW_AT_location    : 5 byte block: 3 9c 0 0 20 	(DW_OP_addr: 2000009c)
 <1><ea4>: Abbrev Number: 3 (DW_TAG_variable)
    <ea5>   DW_AT_name        : (indirect string, offset: 0x7761b): htim2
    <ea9>   DW_AT_decl_file   : 1
    <ea9>   DW_AT_decl_line   : 46
    <eaa>   DW_AT_decl_column : 19
    <eab>   DW_AT_type        : <0xe76>
    <eaf>   DW_AT_external    : 1
    <eaf>   DW_AT_location    : 5 byte block: 3 e4 0 0 20 	(DW_OP_addr: 200000e4)
 <1><eb5>: Abbrev Number: 3 (DW_TAG_variable)
    <eb6>   DW_AT_name        : (indirect string, offset: 0xae2de): htim4
    <eba>   DW_AT_decl_file   : 1
    <eba>   DW_AT_decl_line   : 47
    <ebb>   DW_AT_decl_column : 19
    <ebc>   DW_AT_type        : <0xe76>
    <ec0>   DW_AT_external    : 1
    <ec0>   DW_AT_location    : 5 byte block: 3 2c 1 0 20 	(DW_OP_addr: 2000012c)
 <1><ec6>: Abbrev Number: 3 (DW_TAG_variable)
    <ec7>   DW_AT_name        : (indirect string, offset: 0x28b3c): htim11
    <ecb>   DW_AT_decl_file   : 1
    <ecb>   DW_AT_decl_line   : 48
    <ecc>   DW_AT_decl_column : 19
    <ecd>   DW_AT_type        : <0xe76>
    <ed1>   DW_AT_external    : 1
    <ed1>   DW_AT_location    : 5 byte block: 3 74 1 0 20 	(DW_OP_addr: 20000174)
 <1><ed7>: Abbrev Number: 3 (DW_TAG_variable)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x28b8e): htim12
    <edc>   DW_AT_decl_file   : 1
    <edc>   DW_AT_decl_line   : 49
    <edd>   DW_AT_decl_column : 19
    <ede>   DW_AT_type        : <0xe76>
    <ee2>   DW_AT_external    : 1
    <ee2>   DW_AT_location    : 5 byte block: 3 bc 1 0 20 	(DW_OP_addr: 200001bc)
 <1><ee8>: Abbrev Number: 3 (DW_TAG_variable)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x17d5e): step_delay
    <eed>   DW_AT_decl_file   : 1
    <eed>   DW_AT_decl_line   : 97
    <eee>   DW_AT_decl_column : 10
    <eef>   DW_AT_type        : <0xb6>
    <ef3>   DW_AT_external    : 1
    <ef3>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><ef9>: Abbrev Number: 27 (DW_TAG_variable)
    <efa>   DW_AT_name        : (indirect string, offset: 0x7154d): HIGH_Pulse_Width
    <efe>   DW_AT_decl_file   : 1
    <efe>   DW_AT_decl_line   : 101
    <eff>   DW_AT_decl_column : 17
    <eff>   DW_AT_type        : <0xb6>
    <f03>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><f09>: Abbrev Number: 3 (DW_TAG_variable)
    <f0a>   DW_AT_name        : (indirect string, offset: 0x53618): one_Rotation_Time
    <f0e>   DW_AT_decl_file   : 1
    <f0e>   DW_AT_decl_line   : 102
    <f0f>   DW_AT_decl_column : 10
    <f10>   DW_AT_type        : <0xb6>
    <f14>   DW_AT_external    : 1
    <f14>   DW_AT_location    : 5 byte block: 3 4 2 0 20 	(DW_OP_addr: 20000204)
 <1><f1a>: Abbrev Number: 3 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x30620): one_Rotation_Length
    <f1f>   DW_AT_decl_file   : 1
    <f1f>   DW_AT_decl_line   : 103
    <f20>   DW_AT_decl_column : 7
    <f21>   DW_AT_type        : <0xf2b>
    <f25>   DW_AT_external    : 1
    <f25>   DW_AT_location    : 5 byte block: 3 8 2 0 20 	(DW_OP_addr: 20000208)
 <1><f2b>: Abbrev Number: 10 (DW_TAG_base_type)
    <f2c>   DW_AT_byte_size   : 4
    <f2d>   DW_AT_encoding    : 4	(float)
    <f2e>   DW_AT_name        : (indirect string, offset: 0x3a603): float
 <1><f32>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <f33>   DW_AT_type        : <0xf2b>
 <1><f37>: Abbrev Number: 3 (DW_TAG_variable)
    <f38>   DW_AT_name        : (indirect string, offset: 0x1501d): one_Rotation_MicroStep
    <f3c>   DW_AT_decl_file   : 1
    <f3c>   DW_AT_decl_line   : 104
    <f3d>   DW_AT_decl_column : 10
    <f3e>   DW_AT_type        : <0xb6>
    <f42>   DW_AT_external    : 1
    <f42>   DW_AT_location    : 5 byte block: 3 c 2 0 20 	(DW_OP_addr: 2000020c)
 <1><f48>: Abbrev Number: 3 (DW_TAG_variable)
    <f49>   DW_AT_name        : (indirect string, offset: 0x7bb49): one_MicroStep_Length
    <f4d>   DW_AT_decl_file   : 1
    <f4d>   DW_AT_decl_line   : 106
    <f4e>   DW_AT_decl_column : 7
    <f4f>   DW_AT_type        : <0xf2b>
    <f53>   DW_AT_external    : 1
    <f53>   DW_AT_location    : 5 byte block: 3 10 2 0 20 	(DW_OP_addr: 20000210)
 <1><f59>: Abbrev Number: 3 (DW_TAG_variable)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x4488f): one_Step_Length
    <f5e>   DW_AT_decl_file   : 1
    <f5e>   DW_AT_decl_line   : 107
    <f5f>   DW_AT_decl_column : 10
    <f60>   DW_AT_type        : <0xb6>
    <f64>   DW_AT_external    : 1
    <f64>   DW_AT_location    : 5 byte block: 3 14 2 0 20 	(DW_OP_addr: 20000214)
 <1><f6a>: Abbrev Number: 3 (DW_TAG_variable)
    <f6b>   DW_AT_name        : (indirect string, offset: 0x1c505): one_MicroStep_Time
    <f6f>   DW_AT_decl_file   : 1
    <f6f>   DW_AT_decl_line   : 108
    <f70>   DW_AT_decl_column : 7
    <f71>   DW_AT_type        : <0xf2b>
    <f75>   DW_AT_external    : 1
    <f75>   DW_AT_location    : 5 byte block: 3 18 2 0 20 	(DW_OP_addr: 20000218)
 <1><f7b>: Abbrev Number: 3 (DW_TAG_variable)
    <f7c>   DW_AT_name        : (indirect string, offset: 0x49426): one_Step_Time
    <f80>   DW_AT_decl_file   : 1
    <f80>   DW_AT_decl_line   : 109
    <f81>   DW_AT_decl_column : 10
    <f82>   DW_AT_type        : <0xb6>
    <f86>   DW_AT_external    : 1
    <f86>   DW_AT_location    : 5 byte block: 3 1c 2 0 20 	(DW_OP_addr: 2000021c)
 <1><f8c>: Abbrev Number: 3 (DW_TAG_variable)
    <f8d>   DW_AT_name        : (indirect string, offset: 0x6ea65): Strock_Time
    <f91>   DW_AT_decl_file   : 1
    <f91>   DW_AT_decl_line   : 111
    <f92>   DW_AT_decl_column : 10
    <f93>   DW_AT_type        : <0xb6>
    <f97>   DW_AT_external    : 1
    <f97>   DW_AT_location    : 5 byte block: 3 20 2 0 20 	(DW_OP_addr: 20000220)
 <1><f9d>: Abbrev Number: 3 (DW_TAG_variable)
    <f9e>   DW_AT_name        : (indirect string, offset: 0x5ea51): one_Strock_No_Of_Angle
    <fa2>   DW_AT_decl_file   : 1
    <fa2>   DW_AT_decl_line   : 112
    <fa3>   DW_AT_decl_column : 10
    <fa4>   DW_AT_type        : <0xb6>
    <fa8>   DW_AT_external    : 1
    <fa8>   DW_AT_location    : 5 byte block: 3 24 2 0 20 	(DW_OP_addr: 20000224)
 <1><fae>: Abbrev Number: 3 (DW_TAG_variable)
    <faf>   DW_AT_name        : (indirect string, offset: 0xff33): one_Strock_No_Of_Steps
    <fb3>   DW_AT_decl_file   : 1
    <fb3>   DW_AT_decl_line   : 113
    <fb4>   DW_AT_decl_column : 10
    <fb5>   DW_AT_type        : <0xb6>
    <fb9>   DW_AT_external    : 1
    <fb9>   DW_AT_location    : 5 byte block: 3 28 2 0 20 	(DW_OP_addr: 20000228)
 <1><fbf>: Abbrev Number: 3 (DW_TAG_variable)
    <fc0>   DW_AT_name        : (indirect string, offset: 0x1e0b1): one_Strock_No_Of_MicroSteps
    <fc4>   DW_AT_decl_file   : 1
    <fc4>   DW_AT_decl_line   : 115
    <fc5>   DW_AT_decl_column : 10
    <fc6>   DW_AT_type        : <0xb6>
    <fca>   DW_AT_external    : 1
    <fca>   DW_AT_location    : 5 byte block: 3 2c 2 0 20 	(DW_OP_addr: 2000022c)
 <1><fd0>: Abbrev Number: 3 (DW_TAG_variable)
    <fd1>   DW_AT_name        : (indirect string, offset: 0xb1850): step_In_Incresing_Velocity_Phase
    <fd5>   DW_AT_decl_file   : 1
    <fd5>   DW_AT_decl_line   : 117
    <fd6>   DW_AT_decl_column : 10
    <fd7>   DW_AT_type        : <0xb6>
    <fdb>   DW_AT_external    : 1
    <fdb>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><fe1>: Abbrev Number: 3 (DW_TAG_variable)
    <fe2>   DW_AT_name        : (indirect string, offset: 0x9abbb): step_In_Const_Velocity_Phase
    <fe6>   DW_AT_decl_file   : 1
    <fe6>   DW_AT_decl_line   : 118
    <fe7>   DW_AT_decl_column : 10
    <fe8>   DW_AT_type        : <0xb6>
    <fec>   DW_AT_external    : 1
    <fec>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><ff2>: Abbrev Number: 3 (DW_TAG_variable)
    <ff3>   DW_AT_name        : (indirect string, offset: 0x8f85a): percentage_Accelerate_Acceleration
    <ff7>   DW_AT_decl_file   : 1
    <ff7>   DW_AT_decl_line   : 125
    <ff8>   DW_AT_decl_column : 10
    <ff9>   DW_AT_type        : <0xb6>
    <ffd>   DW_AT_external    : 1
    <ffd>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><1003>: Abbrev Number: 3 (DW_TAG_variable)
    <1004>   DW_AT_name        : (indirect string, offset: 0x435f9): percentage_Const_postive_Acceleration
    <1008>   DW_AT_decl_file   : 1
    <1008>   DW_AT_decl_line   : 126
    <1009>   DW_AT_decl_column : 10
    <100a>   DW_AT_type        : <0xb6>
    <100e>   DW_AT_external    : 1
    <100e>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><1014>: Abbrev Number: 3 (DW_TAG_variable)
    <1015>   DW_AT_name        : (indirect string, offset: 0x136b0): percentage_Zero_Acceleration
    <1019>   DW_AT_decl_file   : 1
    <1019>   DW_AT_decl_line   : 127
    <101a>   DW_AT_decl_column : 10
    <101b>   DW_AT_type        : <0xb6>
    <101f>   DW_AT_external    : 1
    <101f>   DW_AT_location    : 5 byte block: 3 c 0 0 20 	(DW_OP_addr: 2000000c)
 <1><1025>: Abbrev Number: 3 (DW_TAG_variable)
    <1026>   DW_AT_name        : (indirect string, offset: 0x9a6d3): step_In_Const_Pos_Neg_Acceleration_Phase
    <102a>   DW_AT_decl_file   : 1
    <102a>   DW_AT_decl_line   : 129
    <102b>   DW_AT_decl_column : 10
    <102c>   DW_AT_type        : <0xb6>
    <1030>   DW_AT_external    : 1
    <1030>   DW_AT_location    : 5 byte block: 3 30 2 0 20 	(DW_OP_addr: 20000230)
 <1><1036>: Abbrev Number: 3 (DW_TAG_variable)
    <1037>   DW_AT_name        : (indirect string, offset: 0x2806f): step_In_Zero_Acceleration_Phase
    <103b>   DW_AT_decl_file   : 1
    <103b>   DW_AT_decl_line   : 130
    <103c>   DW_AT_decl_column : 10
    <103d>   DW_AT_type        : <0xb6>
    <1041>   DW_AT_external    : 1
    <1041>   DW_AT_location    : 5 byte block: 3 34 2 0 20 	(DW_OP_addr: 20000234)
 <1><1047>: Abbrev Number: 3 (DW_TAG_variable)
    <1048>   DW_AT_name        : (indirect string, offset: 0x77fa1): step_In_Accelerate_Acceleration_Phase
    <104c>   DW_AT_decl_file   : 1
    <104c>   DW_AT_decl_line   : 131
    <104d>   DW_AT_decl_column : 10
    <104e>   DW_AT_type        : <0xb6>
    <1052>   DW_AT_external    : 1
    <1052>   DW_AT_location    : 5 byte block: 3 38 2 0 20 	(DW_OP_addr: 20000238)
 <1><1058>: Abbrev Number: 3 (DW_TAG_variable)
    <1059>   DW_AT_name        : (indirect string, offset: 0xbe20b): step_In_Deaccelerate_Acceleration_Phase
    <105d>   DW_AT_decl_file   : 1
    <105d>   DW_AT_decl_line   : 132
    <105e>   DW_AT_decl_column : 10
    <105f>   DW_AT_type        : <0xb6>
    <1063>   DW_AT_external    : 1
    <1063>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1069>: Abbrev Number: 3 (DW_TAG_variable)
    <106a>   DW_AT_name        : (indirect string, offset: 0xc136): step_Acce_Acce1_Phase
    <106e>   DW_AT_decl_file   : 1
    <106e>   DW_AT_decl_line   : 134
    <106f>   DW_AT_decl_column : 10
    <1070>   DW_AT_type        : <0xb6>
    <1074>   DW_AT_external    : 1
    <1074>   DW_AT_location    : 5 byte block: 3 3c 2 0 20 	(DW_OP_addr: 2000023c)
 <1><107a>: Abbrev Number: 3 (DW_TAG_variable)
    <107b>   DW_AT_name        : (indirect string, offset: 0xba12e): step_Const_Pos_Acce_Phase
    <107f>   DW_AT_decl_file   : 1
    <107f>   DW_AT_decl_line   : 135
    <1080>   DW_AT_decl_column : 10
    <1081>   DW_AT_type        : <0xb6>
